/* automatically generated by rust-bindgen 0.66.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
  storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
  #[inline]
  pub const fn new(storage: Storage) -> Self {
    Self { storage }
  }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
  Storage: AsRef<[u8]> + AsMut<[u8]>,
{
  #[inline]
  pub fn get_bit(&self, index: usize) -> bool {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = self.storage.as_ref()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    byte & mask == mask
  }
  #[inline]
  pub fn set_bit(&mut self, index: usize, val: bool) {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = &mut self.storage.as_mut()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    if val {
      *byte |= mask;
    } else {
      *byte &= !mask;
    }
  }
  #[inline]
  pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
    debug_assert!(bit_width <= 64);
    debug_assert!(bit_offset / 8 < self.storage.as_ref().len());

pub const VIF_OUTOFMEMORY: u32 = 32768;
pub const VIF_CANNOTREADSRC: u32 = 65536;
pub const VIF_CANNOTREADDST: u32 = 131072;
pub const VIF_BUFFTOOSMALL: u32 = 262144;
pub const VIF_CANNOTLOADLZ32: u32 = 524288;
pub const VIF_CANNOTLOADCABINET: u32 = 1048576;
pub const FILE_VER_GET_LOCALISED: u32 = 1;
pub const FILE_VER_GET_NEUTRAL: u32 = 2;
pub const FILE_VER_GET_PREFETCHED: u32 = 4;
pub type ULONG = ::std::os::raw::c_ulong;
pub type PULONG = *mut ULONG;
pub type USHORT = ::std::os::raw::c_ushort;
pub type PUSHORT = *mut USHORT;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type PUCHAR = *mut UCHAR;
pub type PSZ = *mut ::std::os::raw::c_char;
pub type DWORD = ::std::os::raw::c_ulong;
pub type BOOL = ::std::os::raw::c_int;
pub type BYTE = ::std::os::raw::c_uchar;
pub type WORD = ::std::os::raw::c_ushort;
pub type FLOAT = f32;
pub type PFLOAT = *mut FLOAT;
pub type PBOOL = *mut BOOL;
pub type LPBOOL = *mut BOOL;
pub type PBYTE = *mut BYTE;
pub type LPBYTE = *mut BYTE;
pub type PINT = *mut ::std::os::raw::c_int;
pub type LPINT = *mut ::std::os::raw::c_int;
pub type PWORD = *mut WORD;
pub type LPWORD = *mut WORD;
pub type LPLONG = *mut ::std::os::raw::c_long;
pub type PDWORD = *mut DWORD;
pub type LPDWORD = *mut DWORD;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type INT = ::std::os::raw::c_int;
pub type UINT = ::std::os::raw::c_uint;
pub type PUINT = *mut ::std::os::raw::c_uint;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
  pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
  pub fn __security_init_cookie();
}
extern "C" {
  pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
  pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
  pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
  pub fn _invalid_parameter_noinfo();
}
extern "C" {
  pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
  pub fn _invoke_watson(
    _Expression: *const wchar_t,
    _FunctionName: *const wchar_t,
    _FileName: *const wchar_t,
    _LineNo: ::std::os::raw::c_uint,
    _Reserved: usize,
  ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
  pub _locale_pctype: *const ::std::os::raw::c_ushort,
  pub _locale_mb_cur_max: ::std::os::raw::c_int,
  pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
  const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<__crt_locale_data_public>(),
    16usize,
    concat!("Size of: ", stringify!(__crt_locale_data_public))
  );
  assert_eq!(
    ::std::mem::align_of::<__crt_locale_data_public>(),
    8usize,
    concat!("Alignment of ", stringify!(__crt_locale_data_public))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__crt_locale_data_public),
      "::",
      stringify!(_locale_pctype)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__crt_locale_data_public),
      "::",
      stringify!(_locale_mb_cur_max)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(__crt_locale_data_public),
      "::",
      stringify!(_locale_lc_codepage)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
  pub locinfo: *mut __crt_locale_data,
  pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
  const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<__crt_locale_pointers>(),
    16usize,
    concat!("Size of: ", stringify!(__crt_locale_pointers))
  );
  assert_eq!(
    ::std::mem::align_of::<__crt_locale_pointers>(),
    8usize,
    concat!("Alignment of ", stringify!(__crt_locale_pointers))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(__crt_locale_pointers),
      "::",
      stringify!(locinfo)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(__crt_locale_pointers),
      "::",
      stringify!(mbcinfo)
    )
  );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
  pub _Wchar: ::std::os::raw::c_ulong,
  pub _Byte: ::std::os::raw::c_ushort,
  pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
  const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_Mbstatet>(),
    8usize,
    concat!("Size of: ", stringify!(_Mbstatet))
  );
  assert_eq!(
    ::std::mem::align_of::<_Mbstatet>(),
    4usize,
    concat!("Alignment of ", stringify!(_Mbstatet))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_Mbstatet),
      "::",
      stringify!(_Wchar)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_Mbstatet),
      "::",
      stringify!(_Byte)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_Mbstatet),
      "::",
      stringify!(_State)
    )
  );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
  pub fn __pctype_func() -> *const ::std::os::raw::c_ushort;
}
extern "C" {
  pub fn __pwctype_func() -> *const wctype_t;
}
extern "C" {
  pub fn iswalnum(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswalpha(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswascii(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswblank(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswcntrl(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswgraph(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswlower(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswprint(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswpunct(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswspace(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswupper(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iswxdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __iswcsymf(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __iswcsym(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswalnum_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswalpha_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswblank_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswcntrl_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswgraph_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswlower_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswprint_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswpunct_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswspace_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswupper_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswxdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswcsymf_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iswcsym_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn towupper(_C: wint_t) -> wint_t;
}
extern "C" {
  pub fn towlower(_C: wint_t) -> wint_t;
}
extern "C" {
  pub fn iswctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _towupper_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
  pub fn _towlower_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
  pub fn _iswctype_l(_C: wint_t, _Type: wctype_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isleadbyte(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isleadbyte_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn is_wctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isctype(_C: ::std::os::raw::c_int, _Type: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isctype_l(
    _C: ::std::os::raw::c_int,
    _Type: ::std::os::raw::c_int,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isalpha(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isalpha_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isupper_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn islower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _islower_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isdigit(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isdigit_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isxdigit(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isxdigit_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isspace(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isspace_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ispunct(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _ispunct_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isblank(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isblank_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isalnum(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isalnum_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isprint(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isprint_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn isgraph(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _isgraph_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn iscntrl(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _iscntrl_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn toupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn tolower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _tolower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _tolower_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _toupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _toupper_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __isascii(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __toascii(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __iscsymf(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __iscsym(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ___mb_cur_max_func() -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> ::std::os::raw::c_int;
}
pub type POINTER_64_INT = ::std::os::raw::c_ulonglong;
pub type INT8 = ::std::os::raw::c_schar;
pub type PINT8 = *mut ::std::os::raw::c_schar;
pub type INT16 = ::std::os::raw::c_short;
pub type PINT16 = *mut ::std::os::raw::c_short;
pub type INT32 = ::std::os::raw::c_int;
pub type PINT32 = *mut ::std::os::raw::c_int;
pub type INT64 = ::std::os::raw::c_longlong;
pub type PINT64 = *mut ::std::os::raw::c_longlong;
pub type UINT8 = ::std::os::raw::c_uchar;
pub type PUINT8 = *mut ::std::os::raw::c_uchar;
pub type UINT16 = ::std::os::raw::c_ushort;
pub type PUINT16 = *mut ::std::os::raw::c_ushort;
pub type UINT32 = ::std::os::raw::c_uint;
pub type PUINT32 = *mut ::std::os::raw::c_uint;
pub type UINT64 = ::std::os::raw::c_ulonglong;
pub type PUINT64 = *mut ::std::os::raw::c_ulonglong;
pub type LONG32 = ::std::os::raw::c_int;
pub type PLONG32 = *mut ::std::os::raw::c_int;
pub type ULONG32 = ::std::os::raw::c_uint;
pub type PULONG32 = *mut ::std::os::raw::c_uint;
pub type DWORD32 = ::std::os::raw::c_uint;
pub type PDWORD32 = *mut ::std::os::raw::c_uint;
pub type INT_PTR = ::std::os::raw::c_longlong;
pub type PINT_PTR = *mut ::std::os::raw::c_longlong;
pub type UINT_PTR = ::std::os::raw::c_ulonglong;
pub type PUINT_PTR = *mut ::std::os::raw::c_ulonglong;
pub type LONG_PTR = ::std::os::raw::c_longlong;
pub type PLONG_PTR = *mut ::std::os::raw::c_longlong;
pub type ULONG_PTR = ::std::os::raw::c_ulonglong;
pub type PULONG_PTR = *mut ::std::os::raw::c_ulonglong;
pub type PHANDLE64 = *mut *mut ::std::os::raw::c_void;
pub type SHANDLE_PTR = ::std::os::raw::c_longlong;
pub type HANDLE_PTR = ::std::os::raw::c_ulonglong;
pub type UHALF_PTR = ::std::os::raw::c_uint;
pub type PUHALF_PTR = *mut ::std::os::raw::c_uint;
pub type HALF_PTR = ::std::os::raw::c_int;
pub type PHALF_PTR = *mut ::std::os::raw::c_int;
pub type SIZE_T = ULONG_PTR;
pub type PSIZE_T = *mut ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type PSSIZE_T = *mut LONG_PTR;
pub type DWORD_PTR = ULONG_PTR;
pub type PDWORD_PTR = *mut ULONG_PTR;
pub type LONG64 = ::std::os::raw::c_longlong;
pub type PLONG64 = *mut ::std::os::raw::c_longlong;
pub type ULONG64 = ::std::os::raw::c_ulonglong;
pub type PULONG64 = *mut ::std::os::raw::c_ulonglong;
pub type DWORD64 = ::std::os::raw::c_ulonglong;
pub type PDWORD64 = *mut ::std::os::raw::c_ulonglong;
pub type KAFFINITY = ULONG_PTR;
pub type PKAFFINITY = *mut KAFFINITY;
pub type PVOID = *mut ::std::os::raw::c_void;
pub type CHAR = ::std::os::raw::c_char;
pub type SHORT = ::std::os::raw::c_short;
pub type LONG = ::std::os::raw::c_long;
pub type WCHAR = wchar_t;
pub type PWCHAR = *mut WCHAR;
pub type LPWCH = *mut WCHAR;
pub type PWCH = *mut WCHAR;
pub type LPCWCH = *const WCHAR;
pub type PCWCH = *const WCHAR;
pub type NWPSTR = *mut WCHAR;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type PZPWSTR = *mut PWSTR;
pub type PCZPWSTR = *const PWSTR;
pub type LPUWSTR = *mut WCHAR;
pub type PUWSTR = *mut WCHAR;
pub type LPCWSTR = *const WCHAR;
pub type PCWSTR = *const WCHAR;
pub type PZPCWSTR = *mut PCWSTR;
pub type PCZPCWSTR = *const PCWSTR;
pub type LPCUWSTR = *const WCHAR;
pub type PCUWSTR = *const WCHAR;
pub type PZZWSTR = *mut WCHAR;
pub type PCZZWSTR = *const WCHAR;
pub type PUZZWSTR = *mut WCHAR;
pub type PCUZZWSTR = *const WCHAR;
pub type PNZWCH = *mut WCHAR;
pub type PCNZWCH = *const WCHAR;
pub type PUNZWCH = *mut WCHAR;
pub type PCUNZWCH = *const WCHAR;
pub type PCHAR = *mut CHAR;
pub type LPCH = *mut CHAR;
pub type PCH = *mut CHAR;
pub type LPCCH = *const CHAR;
pub type PCCH = *const CHAR;
pub type NPSTR = *mut CHAR;
pub type LPSTR = *mut CHAR;
pub type PSTR = *mut CHAR;
pub type PZPSTR = *mut PSTR;
pub type PCZPSTR = *const PSTR;
pub type LPCSTR = *const CHAR;
pub type PCSTR = *const CHAR;
pub type PZPCSTR = *mut PCSTR;
pub type PCZPCSTR = *const PCSTR;
pub type PZZSTR = *mut CHAR;
pub type PCZZSTR = *const CHAR;
pub type PNZCH = *mut CHAR;
pub type PCNZCH = *const CHAR;
pub type TCHAR = ::std::os::raw::c_char;
pub type PTCHAR = *mut ::std::os::raw::c_char;
pub type TBYTE = ::std::os::raw::c_uchar;
pub type PTBYTE = *mut ::std::os::raw::c_uchar;
pub type LPTCH = LPCH;
pub type PTCH = LPCH;
pub type LPCTCH = LPCCH;
pub type PCTCH = LPCCH;
pub type PTSTR = LPSTR;
pub type LPTSTR = LPSTR;
pub type PUTSTR = LPSTR;
pub type LPUTSTR = LPSTR;
pub type PCTSTR = LPCSTR;
pub type LPCTSTR = LPCSTR;
pub type PCUTSTR = LPCSTR;
pub type LPCUTSTR = LPCSTR;
pub type PZZTSTR = PZZSTR;
pub type PUZZTSTR = PZZSTR;
pub type PCZZTSTR = PCZZSTR;
pub type PCUZZTSTR = PCZZSTR;
pub type PZPTSTR = PZPSTR;
pub type PNZTCH = PNZCH;
pub type PUNZTCH = PNZCH;
pub type PCNZTCH = PCNZCH;
pub type PCUNZTCH = PCNZCH;
pub type PSHORT = *mut SHORT;
pub type PLONG = *mut LONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESSOR_NUMBER {
  pub Group: WORD,
  pub Number: BYTE,
  pub Reserved: BYTE,
}
#[test]
fn bindgen_test_layout__PROCESSOR_NUMBER() {
  const UNINIT: ::std::mem::MaybeUninit<_PROCESSOR_NUMBER> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_PROCESSOR_NUMBER>(),
    4usize,
    concat!("Size of: ", stringify!(_PROCESSOR_NUMBER))
  );
  assert_eq!(
    ::std::mem::align_of::<_PROCESSOR_NUMBER>(),
    2usize,
    concat!("Alignment of ", stringify!(_PROCESSOR_NUMBER))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Group) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_NUMBER),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Number) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_NUMBER),
      "::",
      stringify!(Number)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_NUMBER),
      "::",
      stringify!(Reserved)
    )
  );
}
pub type PROCESSOR_NUMBER = _PROCESSOR_NUMBER;
pub type PPROCESSOR_NUMBER = *mut _PROCESSOR_NUMBER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY {
  pub Mask: KAFFINITY,
  pub Group: WORD,
  pub Reserved: [WORD; 3usize],
}
#[test]
fn bindgen_test_layout__GROUP_AFFINITY() {
  const UNINIT: ::std::mem::MaybeUninit<_GROUP_AFFINITY> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_GROUP_AFFINITY>(),
    16usize,
    concat!("Size of: ", stringify!(_GROUP_AFFINITY))
  );
  assert_eq!(
    ::std::mem::align_of::<_GROUP_AFFINITY>(),
    8usize,
    concat!("Alignment of ", stringify!(_GROUP_AFFINITY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Group) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved) as usize - ptr as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Reserved)
    )
  );
}
pub type GROUP_AFFINITY = _GROUP_AFFINITY;
pub type PGROUP_AFFINITY = *mut _GROUP_AFFINITY;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type PHANDLE = *mut HANDLE;
pub type FCHAR = BYTE;
pub type FSHORT = WORD;
pub type FLONG = DWORD;
pub type HRESULT = ::std::os::raw::c_long;
pub type CCHAR = ::std::os::raw::c_char;
pub type LCID = DWORD;
pub type PLCID = PDWORD;
pub type LANGID = WORD;
pub const COMPARTMENT_ID_UNSPECIFIED_COMPARTMENT_ID: COMPARTMENT_ID = 0;
pub const COMPARTMENT_ID_DEFAULT_COMPARTMENT_ID: COMPARTMENT_ID = 1;
pub type COMPARTMENT_ID = ::std::os::raw::c_int;
pub type PCOMPARTMENT_ID = *mut COMPARTMENT_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FLOAT128 {
  pub LowPart: ::std::os::raw::c_longlong,
  pub HighPart: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout__FLOAT128() {
  const UNINIT: ::std::mem::MaybeUninit<_FLOAT128> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_FLOAT128>(),
    16usize,
    concat!("Size of: ", stringify!(_FLOAT128))
  );
  assert_eq!(
    ::std::mem::align_of::<_FLOAT128>(),
    8usize,
    concat!("Alignment of ", stringify!(_FLOAT128))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_FLOAT128),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_FLOAT128),
      "::",
      stringify!(HighPart)
    )
  );
}
pub type FLOAT128 = _FLOAT128;
pub type PFLOAT128 = *mut FLOAT128;
pub type LONGLONG = ::std::os::raw::c_longlong;
pub type ULONGLONG = ::std::os::raw::c_ulonglong;
pub type PLONGLONG = *mut LONGLONG;
pub type PULONGLONG = *mut ULONGLONG;
pub type USN = LONGLONG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
  pub __bindgen_anon_1: _LARGE_INTEGER__bindgen_ty_1,
  pub u: _LARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_LARGE_INTEGER__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(HighPart)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_2() {
  const UNINIT: ::std::mem::MaybeUninit<_LARGE_INTEGER__bindgen_ty_2> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(HighPart)
    )
  );
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER() {
  const UNINIT: ::std::mem::MaybeUninit<_LARGE_INTEGER> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER>(),
    8usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER),
      "::",
      stringify!(u)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).QuadPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER),
      "::",
      stringify!(QuadPart)
    )
  );
}
pub type LARGE_INTEGER = _LARGE_INTEGER;
pub type PLARGE_INTEGER = *mut LARGE_INTEGER;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ULARGE_INTEGER {
  pub __bindgen_anon_1: _ULARGE_INTEGER__bindgen_ty_1,
  pub u: _ULARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: ULONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_ULARGE_INTEGER__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(HighPart)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER__bindgen_ty_2() {
  const UNINIT: ::std::mem::MaybeUninit<_ULARGE_INTEGER__bindgen_ty_2> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_2>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(HighPart)
    )
  );
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER() {
  const UNINIT: ::std::mem::MaybeUninit<_ULARGE_INTEGER> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER>(),
    8usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER),
      "::",
      stringify!(u)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).QuadPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER),
      "::",
      stringify!(QuadPart)
    )
  );
}
pub type ULARGE_INTEGER = _ULARGE_INTEGER;
pub type PULARGE_INTEGER = *mut ULARGE_INTEGER;
pub type RTL_REFERENCE_COUNT = LONG_PTR;
pub type PRTL_REFERENCE_COUNT = *mut LONG_PTR;
pub type RTL_REFERENCE_COUNT32 = LONG;
pub type PRTL_REFERENCE_COUNT32 = *mut LONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LUID() {
  const UNINIT: ::std::mem::MaybeUninit<_LUID> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LUID>(),
    8usize,
    concat!("Size of: ", stringify!(_LUID))
  );
  assert_eq!(
    ::std::mem::align_of::<_LUID>(),
    4usize,
    concat!("Alignment of ", stringify!(_LUID))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LowPart) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighPart) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID),
      "::",
      stringify!(HighPart)
    )
  );
}
pub type LUID = _LUID;
pub type PLUID = *mut _LUID;
pub type DWORDLONG = ULONGLONG;
pub type PDWORDLONG = *mut DWORDLONG;
extern "C" {
  pub fn _rotl8(
    Value: ::std::os::raw::c_uchar,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _rotl16(
    Value: ::std::os::raw::c_ushort,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_ushort;
}
extern "C" {
  pub fn _rotr8(
    Value: ::std::os::raw::c_uchar,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _rotr16(
    Value: ::std::os::raw::c_ushort,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_ushort;
}
extern "C" {
  pub fn _rotl(
    Value: ::std::os::raw::c_uint,
    Shift: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_uint;
}
extern "C" {
  pub fn _rotl64(
    Value: ::std::os::raw::c_ulonglong,
    Shift: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn _rotr(
    Value: ::std::os::raw::c_uint,
    Shift: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_uint;
}
extern "C" {
  pub fn _rotr64(
    Value: ::std::os::raw::c_ulonglong,
    Shift: ::std::os::raw::c_int,
  ) -> ::std::os::raw::c_ulonglong;
}
pub type BOOLEAN = BYTE;
pub type PBOOLEAN = *mut BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LIST_ENTRY {
  pub Flink: *mut _LIST_ENTRY,
  pub Blink: *mut _LIST_ENTRY,
}
#[test]
fn bindgen_test_layout__LIST_ENTRY() {
  const UNINIT: ::std::mem::MaybeUninit<_LIST_ENTRY> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LIST_ENTRY>(),
    16usize,
    concat!("Size of: ", stringify!(_LIST_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_LIST_ENTRY>(),
    8usize,
    concat!("Alignment of ", stringify!(_LIST_ENTRY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flink) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LIST_ENTRY),
      "::",
      stringify!(Flink)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Blink) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_LIST_ENTRY),
      "::",
      stringify!(Blink)
    )
  );
}
pub type LIST_ENTRY = _LIST_ENTRY;
pub type PLIST_ENTRY = *mut _LIST_ENTRY;
pub type PRLIST_ENTRY = *mut _LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
  pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[test]
fn bindgen_test_layout__SINGLE_LIST_ENTRY() {
  const UNINIT: ::std::mem::MaybeUninit<_SINGLE_LIST_ENTRY> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SINGLE_LIST_ENTRY>(),
    8usize,
    concat!("Size of: ", stringify!(_SINGLE_LIST_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SINGLE_LIST_ENTRY>(),
    8usize,
    concat!("Alignment of ", stringify!(_SINGLE_LIST_ENTRY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Next) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SINGLE_LIST_ENTRY),
      "::",
      stringify!(Next)
    )
  );
}
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
pub type PSINGLE_LIST_ENTRY = *mut _SINGLE_LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LIST_ENTRY32 {
  pub Flink: DWORD,
  pub Blink: DWORD,
}
#[test]
fn bindgen_test_layout_LIST_ENTRY32() {
  const UNINIT: ::std::mem::MaybeUninit<LIST_ENTRY32> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<LIST_ENTRY32>(),
    8usize,
    concat!("Size of: ", stringify!(LIST_ENTRY32))
  );
  assert_eq!(
    ::std::mem::align_of::<LIST_ENTRY32>(),
    4usize,
    concat!("Alignment of ", stringify!(LIST_ENTRY32))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flink) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(LIST_ENTRY32),
      "::",
      stringify!(Flink)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Blink) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(LIST_ENTRY32),
      "::",
      stringify!(Blink)
    )
  );
}
pub type PLIST_ENTRY32 = *mut LIST_ENTRY32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LIST_ENTRY64 {
  pub Flink: ULONGLONG,
  pub Blink: ULONGLONG,
}
#[test]
fn bindgen_test_layout_LIST_ENTRY64() {
  const UNINIT: ::std::mem::MaybeUninit<LIST_ENTRY64> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<LIST_ENTRY64>(),
    16usize,
    concat!("Size of: ", stringify!(LIST_ENTRY64))
  );
  assert_eq!(
    ::std::mem::align_of::<LIST_ENTRY64>(),
    8usize,
    concat!("Alignment of ", stringify!(LIST_ENTRY64))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flink) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(LIST_ENTRY64),
      "::",
      stringify!(Flink)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Blink) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(LIST_ENTRY64),
      "::",
      stringify!(Blink)
    )
  );
}
pub type PLIST_ENTRY64 = *mut LIST_ENTRY64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
  pub Data1: ::std::os::raw::c_ulong,
  pub Data2: ::std::os::raw::c_ushort,
  pub Data3: ::std::os::raw::c_ushort,
  pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
  const UNINIT: ::std::mem::MaybeUninit<_GUID> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_GUID>(),
    16usize,
    concat!("Size of: ", stringify!(_GUID))
  );
  assert_eq!(
    ::std::mem::align_of::<_GUID>(),
    4usize,
    concat!("Alignment of ", stringify!(_GUID))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Data1) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Data2) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Data3) as usize - ptr as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Data4) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data4)
    )
  );
}
pub type GUID = _GUID;
pub type LPGUID = *mut GUID;
pub type LPCGUID = *const GUID;
pub type IID = GUID;
pub type LPIID = *mut IID;
pub type CLSID = GUID;
pub type LPCLSID = *mut CLSID;
pub type FMTID = GUID;
pub type LPFMTID = *mut FMTID;
extern "C" {
  pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
  pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
  pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
  pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
  pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
  pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
  pub fn memchr(
    _Buf: *const ::std::os::raw::c_void,
    _Val: ::std::os::raw::c_int,
    _MaxCount: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn memcmp(
    _Buf1: *const ::std::os::raw::c_void,
    _Buf2: *const ::std::os::raw::c_void,
    _Size: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn memcpy(
    _Dst: *mut ::std::os::raw::c_void,
    _Src: *const ::std::os::raw::c_void,
    _Size: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn memmove(
    _Dst: *mut ::std::os::raw::c_void,
    _Src: *const ::std::os::raw::c_void,
    _Size: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn memset(
    _Dst: *mut ::std::os::raw::c_void,
    _Val: ::std::os::raw::c_int,
    _Size: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn strchr(
    _Str: *const ::std::os::raw::c_char,
    _Val: ::std::os::raw::c_int,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strrchr(
    _Str: *const ::std::os::raw::c_char,
    _Ch: ::std::os::raw::c_int,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strstr(
    _Str: *const ::std::os::raw::c_char,
    _SubStr: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn wcschr(
    _Str: *const ::std::os::raw::c_ushort,
    _Ch: ::std::os::raw::c_ushort,
  ) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
  pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _memicmp(
    _Buf1: *const ::std::os::raw::c_void,
    _Buf2: *const ::std::os::raw::c_void,
    _Size: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _memicmp_l(
    _Buf1: *const ::std::os::raw::c_void,
    _Buf2: *const ::std::os::raw::c_void,
    _Size: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn memccpy(
    _Dst: *mut ::std::os::raw::c_void,
    _Src: *const ::std::os::raw::c_void,
    _Val: ::std::os::raw::c_int,
    _Size: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn memicmp(
    _Buf1: *const ::std::os::raw::c_void,
    _Buf2: *const ::std::os::raw::c_void,
    _Size: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcscat_s(
    _Destination: *mut wchar_t,
    _SizeInWords: rsize_t,
    _Source: *const wchar_t,
  ) -> errno_t;
}
extern "C" {
  pub fn wcscpy_s(
    _Destination: *mut wchar_t,
    _SizeInWords: rsize_t,
    _Source: *const wchar_t,
  ) -> errno_t;
}
extern "C" {
  pub fn wcsncat_s(
    _Destination: *mut wchar_t,
    _SizeInWords: rsize_t,
    _Source: *const wchar_t,
    _MaxCount: rsize_t,
  ) -> errno_t;
}
extern "C" {
  pub fn wcsncpy_s(
    _Destination: *mut wchar_t,
    _SizeInWords: rsize_t,
    _Source: *const wchar_t,
    _MaxCount: rsize_t,
  ) -> errno_t;
}
extern "C" {
  pub fn wcstok_s(
    _String: *mut wchar_t,
    _Delimiter: *const wchar_t,
    _Context: *mut *mut wchar_t,
  ) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcscmp(
    _String1: *const ::std::os::raw::c_ushort,
    _String2: *const ::std::os::raw::c_ushort,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
  pub fn wcslen(_String: *const ::std::os::raw::c_ushort) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
  pub fn wcsncat(
    _Destination: *mut wchar_t,
    _Source: *const wchar_t,
    _Count: usize,
  ) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsncmp(
    _String1: *const ::std::os::raw::c_ushort,
    _String2: *const ::std::os::raw::c_ushort,
    _MaxCount: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcsncpy(
    _Destination: *mut wchar_t,
    _Source: *const wchar_t,
    _Count: usize,
  ) -> *mut wchar_t;
}
extern "C" {
  pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
  pub fn wcstok(
    _String: *mut wchar_t,
    _Delimiter: *const wchar_t,
    _Context: *mut *mut wchar_t,
  ) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcserror_s(
    _Buffer: *mut wchar_t,
    _SizeInWords: usize,
    _ErrorNumber: ::std::os::raw::c_int,
  ) -> errno_t;
}
extern "C" {
  pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn __wcserror_s(
    _Buffer: *mut wchar_t,
    _SizeInWords: usize,
    _ErrorMessage: *const wchar_t,
  ) -> errno_t;
}
extern "C" {
  pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsicmp_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsnicmp(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsnicmp_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsnset_s(
    _Destination: *mut wchar_t,
    _SizeInWords: usize,
    _Value: wchar_t,
    _MaxCount: usize,
  ) -> errno_t;
}
extern "C" {
  pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
extern "C" {
  pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
  pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
  pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
extern "C" {
  pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
  pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
  pub fn _wcsxfrm_l(
    _Destination: *mut wchar_t,
    _Source: *const wchar_t,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> usize;
}
extern "C" {
  pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcscoll_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsicoll_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsncoll(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsncoll_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsnicoll(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _wcsnicoll_l(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcsnicmp(
    _String1: *const wchar_t,
    _String2: *const wchar_t,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
  pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strcpy_s(
    _Destination: *mut ::std::os::raw::c_char,
    _SizeInBytes: rsize_t,
    _Source: *const ::std::os::raw::c_char,
  ) -> errno_t;
}
extern "C" {
  pub fn strcat_s(
    _Destination: *mut ::std::os::raw::c_char,
    _SizeInBytes: rsize_t,
    _Source: *const ::std::os::raw::c_char,
  ) -> errno_t;
}
extern "C" {
  pub fn strerror_s(
    _Buffer: *mut ::std::os::raw::c_char,
    _SizeInBytes: usize,
    _ErrorNumber: ::std::os::raw::c_int,
  ) -> errno_t;
}
extern "C" {
  pub fn strncat_s(
    _Destination: *mut ::std::os::raw::c_char,
    _SizeInBytes: rsize_t,
    _Source: *const ::std::os::raw::c_char,
    _MaxCount: rsize_t,
  ) -> errno_t;
}
extern "C" {
  pub fn strncpy_s(
    _Destination: *mut ::std::os::raw::c_char,
    _SizeInBytes: rsize_t,
    _Source: *const ::std::os::raw::c_char,
    _MaxCount: rsize_t,
  ) -> errno_t;
}
extern "C" {
  pub fn strtok_s(
    _String: *mut ::std::os::raw::c_char,
    _Delimiter: *const ::std::os::raw::c_char,
    _Context: *mut *mut ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _memccpy(
    _Dst: *mut ::std::os::raw::c_void,
    _Src: *const ::std::os::raw::c_void,
    _Val: ::std::os::raw::c_int,
    _MaxCount: usize,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn strcat(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strcmp(
    _Str1: *const ::std::os::raw::c_char,
    _Str2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strcmpi(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strcoll(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strcoll_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strcpy(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strcspn(
    _Str: *const ::std::os::raw::c_char,
    _Control: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn _strdup(_Source: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strerror(_ErrorMessage: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strerror_s(
    _Buffer: *mut ::std::os::raw::c_char,
    _SizeInBytes: usize,
    _ErrorMessage: *const ::std::os::raw::c_char,
  ) -> errno_t;
}
extern "C" {
  pub fn strerror(_ErrorMessage: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _stricmp(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _stricoll(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _stricoll_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _stricmp_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strlen(_Str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn _strlwr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
  pub fn _strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strlwr_s_l(
    _String: *mut ::std::os::raw::c_char,
    _Size: usize,
    _Locale: _locale_t,
  ) -> errno_t;
}
extern "C" {
  pub fn _strlwr_l(
    _String: *mut ::std::os::raw::c_char,
    _Locale: _locale_t,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strncat(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
    _Count: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strncmp(
    _Str1: *const ::std::os::raw::c_char,
    _Str2: *const ::std::os::raw::c_char,
    _MaxCount: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strnicmp(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strnicmp_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strnicoll(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strnicoll_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strncoll(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn _strncoll_l(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn __strncnt(_String: *const ::std::os::raw::c_char, _Count: usize) -> usize;
}
extern "C" {
  pub fn strncpy(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
    _Count: ::std::os::raw::c_ulonglong,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
  pub fn _strnset_s(
    _String: *mut ::std::os::raw::c_char,
    _SizeInBytes: usize,
    _Value: ::std::os::raw::c_int,
    _MaxCount: usize,
  ) -> errno_t;
}
extern "C" {
  pub fn _strnset(
    _Destination: *mut ::std::os::raw::c_char,
    _Value: ::std::os::raw::c_int,
    _Count: usize,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strpbrk(
    _Str: *const ::std::os::raw::c_char,
    _Control: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strrev(_Str: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strset_s(
    _Destination: *mut ::std::os::raw::c_char,
    _DestinationSize: usize,
    _Value: ::std::os::raw::c_int,
  ) -> errno_t;
}
extern "C" {
  pub fn _strset(
    _Destination: *mut ::std::os::raw::c_char,
    _Value: ::std::os::raw::c_int,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strspn(
    _Str: *const ::std::os::raw::c_char,
    _Control: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn strtok(
    _String: *mut ::std::os::raw::c_char,
    _Delimiter: *const ::std::os::raw::c_char,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strupr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
  pub fn _strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn _strupr_s_l(
    _String: *mut ::std::os::raw::c_char,
    _Size: usize,
    _Locale: _locale_t,
  ) -> errno_t;
}
extern "C" {
  pub fn _strupr_l(
    _String: *mut ::std::os::raw::c_char,
    _Locale: _locale_t,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strxfrm(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
    _MaxCount: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn _strxfrm_l(
    _Destination: *mut ::std::os::raw::c_char,
    _Source: *const ::std::os::raw::c_char,
    _MaxCount: usize,
    _Locale: _locale_t,
  ) -> usize;
}
extern "C" {
  pub fn strdup(_String: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strcmpi(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn stricmp(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strnicmp(
    _String1: *const ::std::os::raw::c_char,
    _String2: *const ::std::os::raw::c_char,
    _MaxCount: usize,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn strnset(
    _String: *mut ::std::os::raw::c_char,
    _Value: ::std::os::raw::c_int,
    _MaxCount: usize,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strrev(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strset(
    _String: *mut ::std::os::raw::c_char,
    _Value: ::std::os::raw::c_int,
  ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
  pub fn strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECTID {
  pub Lineage: GUID,
  pub Uniquifier: DWORD,
}
#[test]
fn bindgen_test_layout__OBJECTID() {
  const UNINIT: ::std::mem::MaybeUninit<_OBJECTID> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_OBJECTID>(),
    20usize,
    concat!("Size of: ", stringify!(_OBJECTID))
  );
  assert_eq!(
    ::std::mem::align_of::<_OBJECTID>(),
    4usize,
    concat!("Alignment of ", stringify!(_OBJECTID))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Lineage) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_OBJECTID),
      "::",
      stringify!(Lineage)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Uniquifier) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_OBJECTID),
      "::",
      stringify!(Uniquifier)
    )
  );
}
pub type OBJECTID = _OBJECTID;
pub const _EXCEPTION_DISPOSITION_ExceptionContinueExecution: _EXCEPTION_DISPOSITION = 0;
pub const _EXCEPTION_DISPOSITION_ExceptionContinueSearch: _EXCEPTION_DISPOSITION = 1;
pub const _EXCEPTION_DISPOSITION_ExceptionNestedException: _EXCEPTION_DISPOSITION = 2;
pub const _EXCEPTION_DISPOSITION_ExceptionCollidedUnwind: _EXCEPTION_DISPOSITION = 3;
pub type _EXCEPTION_DISPOSITION = ::std::os::raw::c_int;
pub use self::_EXCEPTION_DISPOSITION as EXCEPTION_DISPOSITION;
extern "C" {
  pub fn __C_specific_handler(
    ExceptionRecord: *mut _EXCEPTION_RECORD,
    EstablisherFrame: *mut ::std::os::raw::c_void,
    ContextRecord: *mut _CONTEXT,
    DispatcherContext: *mut _DISPATCHER_CONTEXT,
  ) -> EXCEPTION_DISPOSITION;
}
extern "C" {
  pub fn _exception_code() -> ::std::os::raw::c_ulong;
}
extern "C" {
  pub fn _exception_info() -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn _abnormal_termination() -> ::std::os::raw::c_int;
}
pub type PEXCEPTION_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    arg1: *mut _EXCEPTION_RECORD,
    arg2: PVOID,
    arg3: *mut _CONTEXT,
    arg4: PVOID,
  ) -> EXCEPTION_DISPOSITION,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _bindgen_ty_1 {
  pub x: ::std::os::raw::c_char,
  pub test: LARGE_INTEGER,
}
#[test]
fn bindgen_test_layout__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_bindgen_ty_1),
      "::",
      stringify!(x)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).test) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_bindgen_ty_1),
      "::",
      stringify!(test)
    )
  );
}
pub type __C_ASSERT__ = [::std::os::raw::c_char; 1usize];
pub type KSPIN_LOCK = ULONG_PTR;
pub type PKSPIN_LOCK = *mut KSPIN_LOCK;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _M128A {
  pub Low: ULONGLONG,
  pub High: LONGLONG,
}
#[test]
fn bindgen_test_layout__M128A() {
  const UNINIT: ::std::mem::MaybeUninit<_M128A> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_M128A>(),
    16usize,
    concat!("Size of: ", stringify!(_M128A))
  );
  assert_eq!(
    ::std::mem::align_of::<_M128A>(),
    16usize,
    concat!("Alignment of ", stringify!(_M128A))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Low) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_M128A),
      "::",
      stringify!(Low)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).High) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_M128A),
      "::",
      stringify!(High)
    )
  );
}
pub type M128A = _M128A;
pub type PM128A = *mut _M128A;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_FORMAT {
  pub ControlWord: WORD,
  pub StatusWord: WORD,
  pub TagWord: BYTE,
  pub Reserved1: BYTE,
  pub ErrorOpcode: WORD,
  pub ErrorOffset: DWORD,
  pub ErrorSelector: WORD,
  pub Reserved2: WORD,
  pub DataOffset: DWORD,
  pub DataSelector: WORD,
  pub Reserved3: WORD,
  pub MxCsr: DWORD,
  pub MxCsr_Mask: DWORD,
  pub FloatRegisters: [M128A; 8usize],
  pub XmmRegisters: [M128A; 16usize],
  pub Reserved4: [BYTE; 96usize],
}
#[test]
fn bindgen_test_layout__XSAVE_FORMAT() {
  const UNINIT: ::std::mem::MaybeUninit<_XSAVE_FORMAT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_XSAVE_FORMAT>(),
    512usize,
    concat!("Size of: ", stringify!(_XSAVE_FORMAT))
  );
  assert_eq!(
    ::std::mem::align_of::<_XSAVE_FORMAT>(),
    16usize,
    concat!("Alignment of ", stringify!(_XSAVE_FORMAT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ControlWord) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(ControlWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).StatusWord) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(StatusWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).TagWord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(TagWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
    5usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ErrorOpcode) as usize - ptr as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(ErrorOpcode)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ErrorOffset) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(ErrorOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ErrorSelector) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(ErrorSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).DataOffset) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(DataOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).DataSelector) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(DataSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved3) as usize - ptr as usize },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(Reserved3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).MxCsr) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(MxCsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).MxCsr_Mask) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(MxCsr_Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FloatRegisters) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(FloatRegisters)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).XmmRegisters) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(XmmRegisters)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved4) as usize - ptr as usize },
    416usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_FORMAT),
      "::",
      stringify!(Reserved4)
    )
  );
}
pub type XSAVE_FORMAT = _XSAVE_FORMAT;
pub type PXSAVE_FORMAT = *mut _XSAVE_FORMAT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_CET_U_FORMAT {
  pub Ia32CetUMsr: DWORD64,
  pub Ia32Pl3SspMsr: DWORD64,
}
#[test]
fn bindgen_test_layout__XSAVE_CET_U_FORMAT() {
  const UNINIT: ::std::mem::MaybeUninit<_XSAVE_CET_U_FORMAT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_XSAVE_CET_U_FORMAT>(),
    16usize,
    concat!("Size of: ", stringify!(_XSAVE_CET_U_FORMAT))
  );
  assert_eq!(
    ::std::mem::align_of::<_XSAVE_CET_U_FORMAT>(),
    8usize,
    concat!("Alignment of ", stringify!(_XSAVE_CET_U_FORMAT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ia32CetUMsr) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_CET_U_FORMAT),
      "::",
      stringify!(Ia32CetUMsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ia32Pl3SspMsr) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_CET_U_FORMAT),
      "::",
      stringify!(Ia32Pl3SspMsr)
    )
  );
}
pub type XSAVE_CET_U_FORMAT = _XSAVE_CET_U_FORMAT;
pub type PXSAVE_CET_U_FORMAT = *mut _XSAVE_CET_U_FORMAT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_AREA_HEADER {
  pub Mask: DWORD64,
  pub CompactionMask: DWORD64,
  pub Reserved2: [DWORD64; 6usize],
}
#[test]
fn bindgen_test_layout__XSAVE_AREA_HEADER() {
  const UNINIT: ::std::mem::MaybeUninit<_XSAVE_AREA_HEADER> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_XSAVE_AREA_HEADER>(),
    64usize,
    concat!("Size of: ", stringify!(_XSAVE_AREA_HEADER))
  );
  assert_eq!(
    ::std::mem::align_of::<_XSAVE_AREA_HEADER>(),
    8usize,
    concat!("Alignment of ", stringify!(_XSAVE_AREA_HEADER))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_AREA_HEADER),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).CompactionMask) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_AREA_HEADER),
      "::",
      stringify!(CompactionMask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved2) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_AREA_HEADER),
      "::",
      stringify!(Reserved2)
    )
  );
}
pub type XSAVE_AREA_HEADER = _XSAVE_AREA_HEADER;
pub type PXSAVE_AREA_HEADER = *mut _XSAVE_AREA_HEADER;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_AREA {
  pub LegacyState: XSAVE_FORMAT,
  pub Header: XSAVE_AREA_HEADER,
}
#[test]
fn bindgen_test_layout__XSAVE_AREA() {
  const UNINIT: ::std::mem::MaybeUninit<_XSAVE_AREA> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_XSAVE_AREA>(),
    576usize,
    concat!("Size of: ", stringify!(_XSAVE_AREA))
  );
  assert_eq!(
    ::std::mem::align_of::<_XSAVE_AREA>(),
    16usize,
    concat!("Alignment of ", stringify!(_XSAVE_AREA))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LegacyState) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_AREA),
      "::",
      stringify!(LegacyState)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    512usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSAVE_AREA),
      "::",
      stringify!(Header)
    )
  );
}
pub type XSAVE_AREA = _XSAVE_AREA;
pub type PXSAVE_AREA = *mut _XSAVE_AREA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSTATE_CONTEXT {
  pub Mask: DWORD64,
  pub Length: DWORD,
  pub Reserved1: DWORD,
  pub Area: PXSAVE_AREA,
  pub Buffer: PVOID,
}
#[test]
fn bindgen_test_layout__XSTATE_CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_XSTATE_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_XSTATE_CONTEXT>(),
    32usize,
    concat!("Size of: ", stringify!(_XSTATE_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_XSTATE_CONTEXT>(),
    8usize,
    concat!("Alignment of ", stringify!(_XSTATE_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSTATE_CONTEXT),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSTATE_CONTEXT),
      "::",
      stringify!(Length)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Reserved1) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSTATE_CONTEXT),
      "::",
      stringify!(Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Area) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSTATE_CONTEXT),
      "::",
      stringify!(Area)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_XSTATE_CONTEXT),
      "::",
      stringify!(Buffer)
    )
  );
}
pub type XSTATE_CONTEXT = _XSTATE_CONTEXT;
pub type PXSTATE_CONTEXT = *mut _XSTATE_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KERNEL_CET_CONTEXT {
  pub Ssp: DWORD64,
  pub Rip: DWORD64,
  pub SegCs: WORD,
  pub __bindgen_anon_1: _KERNEL_CET_CONTEXT__bindgen_ty_1,
  pub Fill: [WORD; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KERNEL_CET_CONTEXT__bindgen_ty_1 {
  pub AllFlags: WORD,
  pub __bindgen_anon_1: _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
  pub _bitfield_align_1: [u16; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout__KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    2usize,
    concat!(
      "Size of: ",
      stringify!(_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    2usize,
    concat!(
      "Alignment of ",
      stringify!(_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
}
impl _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
  #[inline]
  pub fn UseWrss(&self) -> WORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set_UseWrss(&mut self, val: WORD) {
    unsafe {
      let val: u16 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn PopShadowStackOne(&self) -> WORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
  }
  #[inline]
  pub fn set_PopShadowStackOne(&mut self, val: WORD) {
    unsafe {
      let val: u16 = ::std::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Unused(&self) -> WORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 14u8) as u16) }
  }
  #[inline]
  pub fn set_Unused(&mut self, val: WORD) {
    unsafe {
      let val: u16 = ::std::mem::transmute(val);
      self._bitfield_1.set(2usize, 14u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    UseWrss: WORD,
    PopShadowStackOne: WORD,
    Unused: WORD,
  ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let UseWrss: u16 = unsafe { ::std::mem::transmute(UseWrss) };
      UseWrss as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let PopShadowStackOne: u16 = unsafe { ::std::mem::transmute(PopShadowStackOne) };
      PopShadowStackOne as u64
    });
    __bindgen_bitfield_unit.set(2usize, 14u8, {
      let Unused: u16 = unsafe { ::std::mem::transmute(Unused) };
      Unused as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout__KERNEL_CET_CONTEXT__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_KERNEL_CET_CONTEXT__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1>(),
    2usize,
    concat!("Size of: ", stringify!(_KERNEL_CET_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1>(),
    2usize,
    concat!(
      "Alignment of ",
      stringify!(_KERNEL_CET_CONTEXT__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AllFlags) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KERNEL_CET_CONTEXT__bindgen_ty_1),
      "::",
      stringify!(AllFlags)
    )
  );
}
#[test]
fn bindgen_test_layout__KERNEL_CET_CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_KERNEL_CET_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KERNEL_CET_CONTEXT>(),
    24usize,
    concat!("Size of: ", stringify!(_KERNEL_CET_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_KERNEL_CET_CONTEXT>(),
    8usize,
    concat!("Alignment of ", stringify!(_KERNEL_CET_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ssp) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KERNEL_CET_CONTEXT),
      "::",
      stringify!(Ssp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rip) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_KERNEL_CET_CONTEXT),
      "::",
      stringify!(Rip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegCs) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_KERNEL_CET_CONTEXT),
      "::",
      stringify!(SegCs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fill) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_KERNEL_CET_CONTEXT),
      "::",
      stringify!(Fill)
    )
  );
}
pub type KERNEL_CET_CONTEXT = _KERNEL_CET_CONTEXT;
pub type PKERNEL_CET_CONTEXT = *mut _KERNEL_CET_CONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_AMD64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_AMD64__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_AMD64__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BeginAddress) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EndAddress) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HandlerAddress) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).JumpTarget) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_AMD64() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_AMD64> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_AMD64>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_AMD64))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_AMD64>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_AMD64))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ScopeRecord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_AMD64 = _SCOPE_TABLE_AMD64;
pub type PSCOPE_TABLE_AMD64 = *mut _SCOPE_TABLE_AMD64;
extern "C" {
  pub fn _bittest(
    Base: *const ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandcomplement(
    Base: *mut ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandset(
    Base: *mut ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandreset(
    Base: *mut ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _interlockedbittestandset(
    Base: *mut ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _interlockedbittestandreset(
    Base: *mut ::std::os::raw::c_long,
    Offset: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittest64(
    Base: *const ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandcomplement64(
    Base: *mut ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandset64(
    Base: *mut ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _bittestandreset64(
    Base: *mut ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _interlockedbittestandset64(
    Base: *mut ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _interlockedbittestandreset64(
    Base: *mut ::std::os::raw::c_longlong,
    Offset: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _BitScanForward(
    Index: *mut ::std::os::raw::c_ulong,
    Mask: ::std::os::raw::c_ulong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _BitScanReverse(
    Index: *mut ::std::os::raw::c_ulong,
    Mask: ::std::os::raw::c_ulong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _BitScanForward64(
    Index: *mut ::std::os::raw::c_ulong,
    Mask: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _BitScanReverse64(
    Index: *mut ::std::os::raw::c_ulong,
    Mask: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _InterlockedIncrement16(Addend: *mut ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedDecrement16(Addend: *mut ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedCompareExchange16(
    Destination: *mut ::std::os::raw::c_short,
    ExChange: ::std::os::raw::c_short,
    Comperand: ::std::os::raw::c_short,
  ) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedAnd(
    Destination: *mut ::std::os::raw::c_long,
    Value: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedOr(
    Destination: *mut ::std::os::raw::c_long,
    Value: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedXor(
    Destination: *mut ::std::os::raw::c_long,
    Value: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedAnd64(
    Destination: *mut ::std::os::raw::c_longlong,
    Value: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedOr64(
    Destination: *mut ::std::os::raw::c_longlong,
    Value: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedXor64(
    Destination: *mut ::std::os::raw::c_longlong,
    Value: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedIncrement(Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedDecrement(Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedExchange(
    Target: *mut ::std::os::raw::c_long,
    Value: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedExchangeAdd(
    Addend: *mut ::std::os::raw::c_long,
    Value: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedCompareExchange(
    Destination: *mut ::std::os::raw::c_long,
    ExChange: ::std::os::raw::c_long,
    Comperand: ::std::os::raw::c_long,
  ) -> ::std::os::raw::c_long;
}
extern "C" {
  pub fn _InterlockedIncrement64(
    Addend: *mut ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedDecrement64(
    Addend: *mut ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedExchange64(
    Target: *mut ::std::os::raw::c_longlong,
    Value: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedExchangeAdd64(
    Addend: *mut ::std::os::raw::c_longlong,
    Value: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedCompareExchange64(
    Destination: *mut ::std::os::raw::c_longlong,
    ExChange: ::std::os::raw::c_longlong,
    Comperand: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn _InterlockedCompareExchange128(
    Destination: *mut ::std::os::raw::c_longlong,
    ExchangeHigh: ::std::os::raw::c_longlong,
    ExchangeLow: ::std::os::raw::c_longlong,
    ComparandResult: *mut ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn _InterlockedCompareExchangePointer(
    Destination: *mut *mut ::std::os::raw::c_void,
    Exchange: *mut ::std::os::raw::c_void,
    Comperand: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn _InterlockedExchangePointer(
    Target: *mut *mut ::std::os::raw::c_void,
    Value: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
  pub fn _InterlockedExchange8(
    Target: *mut ::std::os::raw::c_char,
    Value: ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_char;
}
extern "C" {
  pub fn _InterlockedExchange16(
    Destination: *mut ::std::os::raw::c_short,
    ExChange: ::std::os::raw::c_short,
  ) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedExchangeAdd8(
    _Addend: *mut ::std::os::raw::c_char,
    _Value: ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_char;
}
extern "C" {
  pub fn _InterlockedAnd8(
    Destination: *mut ::std::os::raw::c_char,
    Value: ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_char;
}
extern "C" {
  pub fn _InterlockedOr8(
    Destination: *mut ::std::os::raw::c_char,
    Value: ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_char;
}
extern "C" {
  pub fn _InterlockedXor8(
    Destination: *mut ::std::os::raw::c_char,
    Value: ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_char;
}
extern "C" {
  pub fn _InterlockedAnd16(
    Destination: *mut ::std::os::raw::c_short,
    Value: ::std::os::raw::c_short,
  ) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedOr16(
    Destination: *mut ::std::os::raw::c_short,
    Value: ::std::os::raw::c_short,
  ) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn _InterlockedXor16(
    Destination: *mut ::std::os::raw::c_short,
    Value: ::std::os::raw::c_short,
  ) -> ::std::os::raw::c_short;
}
extern "C" {
  pub fn __cpuidex(
    CPUInfo: *mut ::std::os::raw::c_int,
    Function: ::std::os::raw::c_int,
    SubLeaf: ::std::os::raw::c_int,
  );
}
extern "C" {
  pub fn _mm_clflush(Address: *const ::std::os::raw::c_void);
}
extern "C" {
  pub fn _ReadWriteBarrier();
}
extern "C" {
  pub fn __faststorefence();
}
extern "C" {
  pub fn _mm_lfence();
}
extern "C" {
  pub fn _mm_mfence();
}
extern "C" {
  pub fn _mm_sfence();
}
extern "C" {
  pub fn _mm_pause();
}
extern "C" {
  pub fn _mm_prefetch(a: *const ::std::os::raw::c_char, sel: ::std::os::raw::c_int);
}
extern "C" {
  pub fn _m_prefetchw(Source: *const ::std::os::raw::c_void);
}
extern "C" {
  pub fn _mm_getcsr() -> ::std::os::raw::c_uint;
}
extern "C" {
  pub fn _mm_setcsr(MxCsr: ::std::os::raw::c_uint);
}
extern "C" {
  pub fn __getcallerseflags() -> ::std::os::raw::c_uint;
}
extern "C" {
  pub fn __segmentlimit(Selector: DWORD) -> DWORD;
}
extern "C" {
  pub fn __readpmc(Counter: DWORD) -> DWORD64;
}
extern "C" {
  pub fn __rdtsc() -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __movsb(Destination: PBYTE, Source: *const BYTE, Count: SIZE_T);
}
extern "C" {
  pub fn __movsw(Destination: PWORD, Source: *const WORD, Count: SIZE_T);
}
extern "C" {
  pub fn __movsd(Destination: PDWORD, Source: *const DWORD, Count: SIZE_T);
}
extern "C" {
  pub fn __movsq(Destination: PDWORD64, Source: *const DWORD64, Count: SIZE_T);
}
extern "C" {
  pub fn __stosb(
    Destination: *mut ::std::os::raw::c_uchar,
    Value: ::std::os::raw::c_uchar,
    Count: ::std::os::raw::c_ulonglong,
  );
}
extern "C" {
  pub fn __stosw(Destination: PWORD, Value: WORD, Count: SIZE_T);
}
extern "C" {
  pub fn __stosd(Destination: PDWORD, Value: DWORD, Count: SIZE_T);
}
extern "C" {
  pub fn __stosq(Destination: PDWORD64, Value: DWORD64, Count: SIZE_T);
}
extern "C" {
  pub fn __mulh(
    Multiplier: ::std::os::raw::c_longlong,
    Multiplicand: ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn __umulh(
    Multiplier: ::std::os::raw::c_ulonglong,
    Multiplicand: ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __popcnt64(operand: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __shiftleft128(
    LowPart: ::std::os::raw::c_ulonglong,
    HighPart: ::std::os::raw::c_ulonglong,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __shiftright128(
    LowPart: ::std::os::raw::c_ulonglong,
    HighPart: ::std::os::raw::c_ulonglong,
    Shift: ::std::os::raw::c_uchar,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn _mul128(
    Multiplier: ::std::os::raw::c_longlong,
    Multiplicand: ::std::os::raw::c_longlong,
    HighProduct: *mut ::std::os::raw::c_longlong,
  ) -> ::std::os::raw::c_longlong;
}
extern "C" {
  pub fn UnsignedMultiply128(
    Multiplier: DWORD64,
    Multiplicand: DWORD64,
    HighProduct: *mut DWORD64,
  ) -> DWORD64;
}
extern "C" {
  pub fn _umul128(
    Multiplier: ::std::os::raw::c_ulonglong,
    Multiplicand: ::std::os::raw::c_ulonglong,
    HighProduct: *mut ::std::os::raw::c_ulonglong,
  ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __readgsbyte(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_uchar;
}
extern "C" {
  pub fn __readgsword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ushort;
}
extern "C" {
  pub fn __readgsdword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
  pub fn __readgsqword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
  pub fn __writegsbyte(Offset: DWORD, Data: BYTE);
}
extern "C" {
  pub fn __writegsword(Offset: DWORD, Data: WORD);
}
extern "C" {
  pub fn __writegsdword(Offset: DWORD, Data: DWORD);
}
extern "C" {
  pub fn __writegsqword(Offset: DWORD, Data: DWORD64);
}
extern "C" {
  pub fn __incgsbyte(Offset: DWORD);
}
extern "C" {
  pub fn __addgsbyte(Offset: DWORD, Value: BYTE);
}
extern "C" {
  pub fn __incgsword(Offset: DWORD);
}
extern "C" {
  pub fn __addgsword(Offset: DWORD, Value: WORD);
}
extern "C" {
  pub fn __incgsdword(Offset: DWORD);
}
extern "C" {
  pub fn __addgsdword(Offset: DWORD, Value: DWORD);
}
extern "C" {
  pub fn __incgsqword(Offset: DWORD);
}
extern "C" {
  pub fn __addgsqword(Offset: DWORD, Value: DWORD64);
}
pub type XMM_SAVE_AREA32 = XSAVE_FORMAT;
pub type PXMM_SAVE_AREA32 = *mut XSAVE_FORMAT;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _CONTEXT {
  pub P1Home: DWORD64,
  pub P2Home: DWORD64,
  pub P3Home: DWORD64,
  pub P4Home: DWORD64,
  pub P5Home: DWORD64,
  pub P6Home: DWORD64,
  pub ContextFlags: DWORD,
  pub MxCsr: DWORD,
  pub SegCs: WORD,
  pub SegDs: WORD,
  pub SegEs: WORD,
  pub SegFs: WORD,
  pub SegGs: WORD,
  pub SegSs: WORD,
  pub EFlags: DWORD,
  pub Dr0: DWORD64,
  pub Dr1: DWORD64,
  pub Dr2: DWORD64,
  pub Dr3: DWORD64,
  pub Dr6: DWORD64,
  pub Dr7: DWORD64,
  pub Rax: DWORD64,
  pub Rcx: DWORD64,
  pub Rdx: DWORD64,
  pub Rbx: DWORD64,
  pub Rsp: DWORD64,
  pub Rbp: DWORD64,
  pub Rsi: DWORD64,
  pub Rdi: DWORD64,
  pub R8: DWORD64,
  pub R9: DWORD64,
  pub R10: DWORD64,
  pub R11: DWORD64,
  pub R12: DWORD64,
  pub R13: DWORD64,
  pub R14: DWORD64,
  pub R15: DWORD64,
  pub Rip: DWORD64,
  pub __bindgen_anon_1: _CONTEXT__bindgen_ty_1,
  pub VectorRegister: [M128A; 26usize],
  pub VectorControl: DWORD64,
  pub DebugControl: DWORD64,
  pub LastBranchToRip: DWORD64,
  pub LastBranchFromRip: DWORD64,
  pub LastExceptionToRip: DWORD64,
  pub LastExceptionFromRip: DWORD64,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _CONTEXT__bindgen_ty_1 {
  pub FltSave: XMM_SAVE_AREA32,
  pub __bindgen_anon_1: _CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _CONTEXT__bindgen_ty_1__bindgen_ty_1 {
  pub Header: [M128A; 2usize],
  pub Legacy: [M128A; 8usize],
  pub Xmm0: M128A,
  pub Xmm1: M128A,
  pub Xmm2: M128A,
  pub Xmm3: M128A,
  pub Xmm4: M128A,
  pub Xmm5: M128A,
  pub Xmm6: M128A,
  pub Xmm7: M128A,
  pub Xmm8: M128A,
  pub Xmm9: M128A,
  pub Xmm10: M128A,
  pub Xmm11: M128A,
  pub Xmm12: M128A,
  pub Xmm13: M128A,
  pub Xmm14: M128A,
  pub Xmm15: M128A,
}
#[test]
fn bindgen_test_layout__CONTEXT__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_CONTEXT__bindgen_ty_1__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    416usize,
    concat!(
      "Size of: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    16usize,
    concat!(
      "Alignment of ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Legacy) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Legacy)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm0) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm1) as usize - ptr as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm2) as usize - ptr as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm3) as usize - ptr as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm4) as usize - ptr as usize },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm4)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm5) as usize - ptr as usize },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm5)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm6) as usize - ptr as usize },
    256usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm7) as usize - ptr as usize },
    272usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm8) as usize - ptr as usize },
    288usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm9) as usize - ptr as usize },
    304usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm10) as usize - ptr as usize },
    320usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm11) as usize - ptr as usize },
    336usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm12) as usize - ptr as usize },
    352usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm13) as usize - ptr as usize },
    368usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm14) as usize - ptr as usize },
    384usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm15) as usize - ptr as usize },
    400usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm15)
    )
  );
}
#[test]
fn bindgen_test_layout__CONTEXT__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_CONTEXT__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_CONTEXT__bindgen_ty_1>(),
    512usize,
    concat!("Size of: ", stringify!(_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_CONTEXT__bindgen_ty_1>(),
    16usize,
    concat!("Alignment of ", stringify!(_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FltSave) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT__bindgen_ty_1),
      "::",
      stringify!(FltSave)
    )
  );
}
#[test]
fn bindgen_test_layout__CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_CONTEXT>(),
    1232usize,
    concat!("Size of: ", stringify!(_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_CONTEXT>(),
    16usize,
    concat!("Alignment of ", stringify!(_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P1Home) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P1Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P2Home) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P2Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P3Home) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P3Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P4Home) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P4Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P5Home) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P5Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).P6Home) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(P6Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextFlags) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(ContextFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).MxCsr) as usize - ptr as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(MxCsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegCs) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegCs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegDs) as usize - ptr as usize },
    58usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegDs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegEs) as usize - ptr as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegEs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegFs) as usize - ptr as usize },
    62usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegFs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegGs) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegGs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegSs) as usize - ptr as usize },
    66usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(SegSs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EFlags) as usize - ptr as usize },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(EFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr0) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr1) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr2) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr3) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr6) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr7) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Dr7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rax) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rax)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rcx) as usize - ptr as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rcx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rdx) as usize - ptr as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rdx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rbx) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rbx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rsp) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rsp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rbp) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rbp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rsi) as usize - ptr as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rsi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rdi) as usize - ptr as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rdi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R8) as usize - ptr as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R9) as usize - ptr as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R10) as usize - ptr as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R11) as usize - ptr as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R12) as usize - ptr as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R13) as usize - ptr as usize },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R14) as usize - ptr as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R15) as usize - ptr as usize },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(R15)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rip) as usize - ptr as usize },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(Rip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).VectorRegister) as usize - ptr as usize },
    768usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(VectorRegister)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).VectorControl) as usize - ptr as usize },
    1184usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(VectorControl)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).DebugControl) as usize - ptr as usize },
    1192usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(DebugControl)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LastBranchToRip) as usize - ptr as usize },
    1200usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(LastBranchToRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LastBranchFromRip) as usize - ptr as usize },
    1208usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(LastBranchFromRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LastExceptionToRip) as usize - ptr as usize },
    1216usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(LastExceptionToRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LastExceptionFromRip) as usize - ptr as usize },
    1224usize,
    concat!(
      "Offset of field: ",
      stringify!(_CONTEXT),
      "::",
      stringify!(LastExceptionFromRip)
    )
  );
}
pub type CONTEXT = _CONTEXT;
pub type PCONTEXT = *mut _CONTEXT;
pub type RUNTIME_FUNCTION = _IMAGE_RUNTIME_FUNCTION_ENTRY;
pub type PRUNTIME_FUNCTION = *mut _IMAGE_RUNTIME_FUNCTION_ENTRY;
pub type SCOPE_TABLE = SCOPE_TABLE_AMD64;
pub type PSCOPE_TABLE = *mut SCOPE_TABLE_AMD64;
pub type GET_RUNTIME_FUNCTION_CALLBACK = ::std::option::Option<
  unsafe extern "C" fn(ControlPc: DWORD64, Context: PVOID) -> PRUNTIME_FUNCTION,
>;
pub type PGET_RUNTIME_FUNCTION_CALLBACK = GET_RUNTIME_FUNCTION_CALLBACK;
pub type OUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK = ::std::option::Option<
  unsafe extern "C" fn(
    Process: HANDLE,
    TableAddress: PVOID,
    Entries: PDWORD,
    Functions: *mut PRUNTIME_FUNCTION,
  ) -> DWORD,
>;
pub type POUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK = OUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT {
  pub ControlPc: DWORD64,
  pub ImageBase: DWORD64,
  pub FunctionEntry: PRUNTIME_FUNCTION,
  pub EstablisherFrame: DWORD64,
  pub TargetIp: DWORD64,
  pub ContextRecord: PCONTEXT,
  pub LanguageHandler: PEXCEPTION_ROUTINE,
  pub HandlerData: PVOID,
  pub HistoryTable: *mut _UNWIND_HISTORY_TABLE,
  pub ScopeIndex: DWORD,
  pub Fill0: DWORD,
}
#[test]
fn bindgen_test_layout__DISPATCHER_CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_DISPATCHER_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_DISPATCHER_CONTEXT>(),
    80usize,
    concat!("Size of: ", stringify!(_DISPATCHER_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_DISPATCHER_CONTEXT>(),
    8usize,
    concat!("Alignment of ", stringify!(_DISPATCHER_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ControlPc) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(ControlPc)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ImageBase) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(ImageBase)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FunctionEntry) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(FunctionEntry)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EstablisherFrame) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(EstablisherFrame)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).TargetIp) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(TargetIp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextRecord) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(ContextRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LanguageHandler) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(LanguageHandler)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HandlerData) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(HandlerData)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HistoryTable) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(HistoryTable)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ScopeIndex) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(ScopeIndex)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fill0) as usize - ptr as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT),
      "::",
      stringify!(Fill0)
    )
  );
}
pub type DISPATCHER_CONTEXT = _DISPATCHER_CONTEXT;
pub type PDISPATCHER_CONTEXT = *mut _DISPATCHER_CONTEXT;
pub type PEXCEPTION_FILTER = ::std::option::Option<
  unsafe extern "C" fn(
    ExceptionPointers: *mut _EXCEPTION_POINTERS,
    EstablisherFrame: PVOID,
  ) -> LONG,
>;
pub type PTERMINATION_HANDLER = ::std::option::Option<
  unsafe extern "C" fn(_abnormal_termination: BOOLEAN, EstablisherFrame: PVOID),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS {
  pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1,
  pub __bindgen_anon_2: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1 {
  pub FloatingContext: [PM128A; 16usize],
  pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1 {
  pub Xmm0: PM128A,
  pub Xmm1: PM128A,
  pub Xmm2: PM128A,
  pub Xmm3: PM128A,
  pub Xmm4: PM128A,
  pub Xmm5: PM128A,
  pub Xmm6: PM128A,
  pub Xmm7: PM128A,
  pub Xmm8: PM128A,
  pub Xmm9: PM128A,
  pub Xmm10: PM128A,
  pub Xmm11: PM128A,
  pub Xmm12: PM128A,
  pub Xmm13: PM128A,
  pub Xmm14: PM128A,
  pub Xmm15: PM128A,
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<
    _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
  > = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1>(),
    128usize,
    concat!(
      "Size of: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm0) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm1) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm2) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm3) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm4) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm4)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm5) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm5)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm6) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm7) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm8) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm9) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm10) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm11) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm12) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm13) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm14) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Xmm15) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Xmm15)
    )
  );
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1>(),
    128usize,
    concat!(
      "Size of: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FloatingContext) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1),
      "::",
      stringify!(FloatingContext)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2 {
  pub IntegerContext: [PDWORD64; 16usize],
  pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1 {
  pub Rax: PDWORD64,
  pub Rcx: PDWORD64,
  pub Rdx: PDWORD64,
  pub Rbx: PDWORD64,
  pub Rsp: PDWORD64,
  pub Rbp: PDWORD64,
  pub Rsi: PDWORD64,
  pub Rdi: PDWORD64,
  pub R8: PDWORD64,
  pub R9: PDWORD64,
  pub R10: PDWORD64,
  pub R11: PDWORD64,
  pub R12: PDWORD64,
  pub R13: PDWORD64,
  pub R14: PDWORD64,
  pub R15: PDWORD64,
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<
    _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
  > = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1>(),
    128usize,
    concat!(
      "Size of: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rax) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rax)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rcx) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rcx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rdx) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rdx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rbx) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rbx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rsp) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rsp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rbp) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rbp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rsi) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rsi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Rdi) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(Rdi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R8) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R9) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R10) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R11) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R12) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R13) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R14) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).R15) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1),
      "::",
      stringify!(R15)
    )
  );
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2() {
  const UNINIT: ::std::mem::MaybeUninit<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2>(),
    128usize,
    concat!(
      "Size of: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).IntegerContext) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2),
      "::",
      stringify!(IntegerContext)
    )
  );
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS() {
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS>(),
    256usize,
    concat!("Size of: ", stringify!(_KNONVOLATILE_CONTEXT_POINTERS))
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS>(),
    8usize,
    concat!("Alignment of ", stringify!(_KNONVOLATILE_CONTEXT_POINTERS))
  );
}
pub type KNONVOLATILE_CONTEXT_POINTERS = _KNONVOLATILE_CONTEXT_POINTERS;
pub type PKNONVOLATILE_CONTEXT_POINTERS = *mut _KNONVOLATILE_CONTEXT_POINTERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_ARM__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BeginAddress) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EndAddress) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HandlerAddress) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).JumpTarget) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_ARM> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ScopeRecord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_ARM = _SCOPE_TABLE_ARM;
pub type PSCOPE_TABLE_ARM = *mut _SCOPE_TABLE_ARM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM64__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_ARM64__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BeginAddress) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EndAddress) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HandlerAddress) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).JumpTarget) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM64() {
  const UNINIT: ::std::mem::MaybeUninit<_SCOPE_TABLE_ARM64> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM64>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM64))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM64>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM64))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Count) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ScopeRecord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_ARM64 = _SCOPE_TABLE_ARM64;
pub type PSCOPE_TABLE_ARM64 = *mut _SCOPE_TABLE_ARM64;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64_NT_NEON128 {
  pub __bindgen_anon_1: _ARM64_NT_NEON128__bindgen_ty_1,
  pub D: [f64; 2usize],
  pub S: [f32; 4usize],
  pub H: [WORD; 8usize],
  pub B: [BYTE; 16usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ARM64_NT_NEON128__bindgen_ty_1 {
  pub Low: ULONGLONG,
  pub High: LONGLONG,
}
#[test]
fn bindgen_test_layout__ARM64_NT_NEON128__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64_NT_NEON128__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64_NT_NEON128__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_ARM64_NT_NEON128__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64_NT_NEON128__bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_ARM64_NT_NEON128__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Low) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128__bindgen_ty_1),
      "::",
      stringify!(Low)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).High) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128__bindgen_ty_1),
      "::",
      stringify!(High)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64_NT_NEON128() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64_NT_NEON128> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64_NT_NEON128>(),
    16usize,
    concat!("Size of: ", stringify!(_ARM64_NT_NEON128))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64_NT_NEON128>(),
    8usize,
    concat!("Alignment of ", stringify!(_ARM64_NT_NEON128))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128),
      "::",
      stringify!(D)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).S) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128),
      "::",
      stringify!(S)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).H) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128),
      "::",
      stringify!(H)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).B) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_NEON128),
      "::",
      stringify!(B)
    )
  );
}
pub type ARM64_NT_NEON128 = _ARM64_NT_NEON128;
pub type PARM64_NT_NEON128 = *mut _ARM64_NT_NEON128;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _ARM64_NT_CONTEXT {
  pub ContextFlags: DWORD,
  pub Cpsr: DWORD,
  pub __bindgen_anon_1: _ARM64_NT_CONTEXT__bindgen_ty_1,
  pub Sp: DWORD64,
  pub Pc: DWORD64,
  pub V: [ARM64_NT_NEON128; 32usize],
  pub Fpcr: DWORD,
  pub Fpsr: DWORD,
  pub Bcr: [DWORD; 8usize],
  pub Bvr: [DWORD64; 8usize],
  pub Wcr: [DWORD; 2usize],
  pub Wvr: [DWORD64; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64_NT_CONTEXT__bindgen_ty_1 {
  pub __bindgen_anon_1: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
  pub X: [DWORD64; 31usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
  pub X0: DWORD64,
  pub X1: DWORD64,
  pub X2: DWORD64,
  pub X3: DWORD64,
  pub X4: DWORD64,
  pub X5: DWORD64,
  pub X6: DWORD64,
  pub X7: DWORD64,
  pub X8: DWORD64,
  pub X9: DWORD64,
  pub X10: DWORD64,
  pub X11: DWORD64,
  pub X12: DWORD64,
  pub X13: DWORD64,
  pub X14: DWORD64,
  pub X15: DWORD64,
  pub X16: DWORD64,
  pub X17: DWORD64,
  pub X18: DWORD64,
  pub X19: DWORD64,
  pub X20: DWORD64,
  pub X21: DWORD64,
  pub X22: DWORD64,
  pub X23: DWORD64,
  pub X24: DWORD64,
  pub X25: DWORD64,
  pub X26: DWORD64,
  pub X27: DWORD64,
  pub X28: DWORD64,
  pub Fp: DWORD64,
  pub Lr: DWORD64,
}
#[test]
fn bindgen_test_layout__ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    248usize,
    concat!(
      "Size of: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X0) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X1) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X2) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X3) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X4) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X4)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X5) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X5)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X6) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X7) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X8) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X9) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X10) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X11) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X12) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X13) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X14) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X15) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X15)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X16) as usize - ptr as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X16)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X17) as usize - ptr as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X17)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X18) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X18)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X19) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X19)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X20) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X20)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X21) as usize - ptr as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X21)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X22) as usize - ptr as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X22)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X23) as usize - ptr as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X23)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X24) as usize - ptr as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X24)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X25) as usize - ptr as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X25)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X26) as usize - ptr as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X26)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X27) as usize - ptr as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X27)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X28) as usize - ptr as usize },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X28)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fp) as usize - ptr as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Fp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Lr) as usize - ptr as usize },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Lr)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64_NT_CONTEXT__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64_NT_CONTEXT__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64_NT_CONTEXT__bindgen_ty_1>(),
    248usize,
    concat!("Size of: ", stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64_NT_CONTEXT__bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT__bindgen_ty_1),
      "::",
      stringify!(X)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64_NT_CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64_NT_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64_NT_CONTEXT>(),
    912usize,
    concat!("Size of: ", stringify!(_ARM64_NT_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64_NT_CONTEXT>(),
    16usize,
    concat!("Alignment of ", stringify!(_ARM64_NT_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextFlags) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(ContextFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Cpsr) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Cpsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sp) as usize - ptr as usize },
    256usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Sp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Pc) as usize - ptr as usize },
    264usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Pc)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).V) as usize - ptr as usize },
    272usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(V)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fpcr) as usize - ptr as usize },
    784usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Fpcr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fpsr) as usize - ptr as usize },
    788usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Fpsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bcr) as usize - ptr as usize },
    792usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Bcr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bvr) as usize - ptr as usize },
    824usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Bvr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Wcr) as usize - ptr as usize },
    888usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Wcr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Wvr) as usize - ptr as usize },
    896usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64_NT_CONTEXT),
      "::",
      stringify!(Wvr)
    )
  );
}
pub type ARM64_NT_CONTEXT = _ARM64_NT_CONTEXT;
pub type PARM64_NT_CONTEXT = *mut _ARM64_NT_CONTEXT;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT {
  pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64EC_NT_CONTEXT__bindgen_ty_1 {
  pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
  pub AMD64_P1Home: DWORD64,
  pub AMD64_P2Home: DWORD64,
  pub AMD64_P3Home: DWORD64,
  pub AMD64_P4Home: DWORD64,
  pub AMD64_P5Home: DWORD64,
  pub AMD64_P6Home: DWORD64,
  pub ContextFlags: DWORD,
  pub AMD64_MxCsr_copy: DWORD,
  pub AMD64_SegCs: WORD,
  pub AMD64_SegDs: WORD,
  pub AMD64_SegEs: WORD,
  pub AMD64_SegFs: WORD,
  pub AMD64_SegGs: WORD,
  pub AMD64_SegSs: WORD,
  pub AMD64_EFlags: DWORD,
  pub AMD64_Dr0: DWORD64,
  pub AMD64_Dr1: DWORD64,
  pub AMD64_Dr2: DWORD64,
  pub AMD64_Dr3: DWORD64,
  pub AMD64_Dr6: DWORD64,
  pub AMD64_Dr7: DWORD64,
  pub X8: DWORD64,
  pub X0: DWORD64,
  pub X1: DWORD64,
  pub X27: DWORD64,
  pub Sp: DWORD64,
  pub Fp: DWORD64,
  pub X25: DWORD64,
  pub X26: DWORD64,
  pub X2: DWORD64,
  pub X3: DWORD64,
  pub X4: DWORD64,
  pub X5: DWORD64,
  pub X19: DWORD64,
  pub X20: DWORD64,
  pub X21: DWORD64,
  pub X22: DWORD64,
  pub Pc: DWORD64,
  pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
  pub AMD64_VectorRegister: [ARM64_NT_NEON128; 26usize],
  pub AMD64_VectorControl: DWORD64,
  pub AMD64_DebugControl: DWORD64,
  pub AMD64_LastBranchToRip: DWORD64,
  pub AMD64_LastBranchFromRip: DWORD64,
  pub AMD64_LastExceptionToRip: DWORD64,
  pub AMD64_LastExceptionFromRip: DWORD64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  pub AMD64_ControlWord: WORD,
  pub AMD64_StatusWord: WORD,
  pub AMD64_TagWord: BYTE,
  pub AMD64_Reserved1: BYTE,
  pub AMD64_ErrorOpcode: WORD,
  pub AMD64_ErrorOffset: DWORD,
  pub AMD64_ErrorSelector: WORD,
  pub AMD64_Reserved2: WORD,
  pub AMD64_DataOffset: DWORD,
  pub AMD64_DataSelector: WORD,
  pub AMD64_Reserved3: WORD,
  pub AMD64_MxCsr: DWORD,
  pub AMD64_MxCsr_Mask: DWORD,
  pub Lr: DWORD64,
  pub X16_0: WORD,
  pub AMD64_St0_Reserved1: WORD,
  pub AMD64_St0_Reserved2: DWORD,
  pub X6: DWORD64,
  pub X16_1: WORD,
  pub AMD64_St1_Reserved1: WORD,
  pub AMD64_St1_Reserved2: DWORD,
  pub X7: DWORD64,
  pub X16_2: WORD,
  pub AMD64_St2_Reserved1: WORD,
  pub AMD64_St2_Reserved2: DWORD,
  pub X9: DWORD64,
  pub X16_3: WORD,
  pub AMD64_St3_Reserved1: WORD,
  pub AMD64_St3_Reserved2: DWORD,
  pub X10: DWORD64,
  pub X17_0: WORD,
  pub AMD64_St4_Reserved1: WORD,
  pub AMD64_St4_Reserved2: DWORD,
  pub X11: DWORD64,
  pub X17_1: WORD,
  pub AMD64_St5_Reserved1: WORD,
  pub AMD64_St5_Reserved2: DWORD,
  pub X12: DWORD64,
  pub X17_2: WORD,
  pub AMD64_St6_Reserved1: WORD,
  pub AMD64_St6_Reserved2: DWORD,
  pub X15: DWORD64,
  pub X17_3: WORD,
  pub AMD64_St7_Reserved1: WORD,
  pub AMD64_St7_Reserved2: DWORD,
  pub V: [ARM64_NT_NEON128; 16usize],
  pub AMD64_XSAVE_FORMAT_Reserved4: [BYTE; 96usize],
}
#[test]
fn bindgen_test_layout__ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<
    _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
  > = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
    512usize,
    concat!(
      "Size of: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_ControlWord) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_ControlWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_StatusWord) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_StatusWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_TagWord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_TagWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Reserved1) as usize - ptr as usize },
    5usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_ErrorOpcode) as usize - ptr as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_ErrorOpcode)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_ErrorOffset) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_ErrorOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_ErrorSelector) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_ErrorSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Reserved2) as usize - ptr as usize },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_DataOffset) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_DataOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_DataSelector) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_DataSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Reserved3) as usize - ptr as usize },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Reserved3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_MxCsr) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_MxCsr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_MxCsr_Mask) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_MxCsr_Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Lr) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Lr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X16_0) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X16_0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St0_Reserved1) as usize - ptr as usize },
    42usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St0_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St0_Reserved2) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St0_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X6) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X16_1) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X16_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St1_Reserved1) as usize - ptr as usize },
    58usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St1_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St1_Reserved2) as usize - ptr as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St1_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X7) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X16_2) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X16_2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St2_Reserved1) as usize - ptr as usize },
    74usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St2_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St2_Reserved2) as usize - ptr as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St2_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X9) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X16_3) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X16_3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St3_Reserved1) as usize - ptr as usize },
    90usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St3_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St3_Reserved2) as usize - ptr as usize },
    92usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St3_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X10) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X17_0) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X17_0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St4_Reserved1) as usize - ptr as usize },
    106usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St4_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St4_Reserved2) as usize - ptr as usize },
    108usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St4_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X11) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X17_1) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X17_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St5_Reserved1) as usize - ptr as usize },
    122usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St5_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St5_Reserved2) as usize - ptr as usize },
    124usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St5_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X12) as usize - ptr as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X17_2) as usize - ptr as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X17_2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St6_Reserved1) as usize - ptr as usize },
    138usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St6_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St6_Reserved2) as usize - ptr as usize },
    140usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St6_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X15) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X15)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X17_3) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X17_3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St7_Reserved1) as usize - ptr as usize },
    154usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St7_Reserved1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_St7_Reserved2) as usize - ptr as usize },
    156usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_St7_Reserved2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).V) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(V)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_XSAVE_FORMAT_Reserved4) as usize - ptr as usize },
    416usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_XSAVE_FORMAT_Reserved4)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    1232usize,
    concat!(
      "Size of: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P1Home) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P1Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P2Home) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P2Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P3Home) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P3Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P4Home) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P4Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P5Home) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P5Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_P6Home) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_P6Home)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextFlags) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(ContextFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_MxCsr_copy) as usize - ptr as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_MxCsr_copy)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegCs) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegCs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegDs) as usize - ptr as usize },
    58usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegDs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegEs) as usize - ptr as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegEs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegFs) as usize - ptr as usize },
    62usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegFs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegGs) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegGs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_SegSs) as usize - ptr as usize },
    66usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_SegSs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_EFlags) as usize - ptr as usize },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_EFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr0) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr1) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr2) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr3) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr6) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_Dr7) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_Dr7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X8) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X0) as usize - ptr as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X1) as usize - ptr as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X27) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X27)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sp) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Sp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fp) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Fp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X25) as usize - ptr as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X25)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X26) as usize - ptr as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X26)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X2) as usize - ptr as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X3) as usize - ptr as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X4) as usize - ptr as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X4)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X5) as usize - ptr as usize },
    208usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X5)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X19) as usize - ptr as usize },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X19)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X20) as usize - ptr as usize },
    224usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X20)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X21) as usize - ptr as usize },
    232usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X21)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X22) as usize - ptr as usize },
    240usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(X22)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Pc) as usize - ptr as usize },
    248usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Pc)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_VectorRegister) as usize - ptr as usize },
    768usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_VectorRegister)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_VectorControl) as usize - ptr as usize },
    1184usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_VectorControl)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_DebugControl) as usize - ptr as usize },
    1192usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_DebugControl)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_LastBranchToRip) as usize - ptr as usize },
    1200usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_LastBranchToRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_LastBranchFromRip) as usize - ptr as usize },
    1208usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_LastBranchFromRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_LastExceptionToRip) as usize - ptr as usize },
    1216usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_LastExceptionToRip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AMD64_LastExceptionFromRip) as usize - ptr as usize },
    1224usize,
    concat!(
      "Offset of field: ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AMD64_LastExceptionFromRip)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64EC_NT_CONTEXT__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1>(),
    1232usize,
    concat!("Size of: ", stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_ARM64EC_NT_CONTEXT__bindgen_ty_1)
    )
  );
}
#[test]
fn bindgen_test_layout__ARM64EC_NT_CONTEXT() {
  assert_eq!(
    ::std::mem::size_of::<_ARM64EC_NT_CONTEXT>(),
    1232usize,
    concat!("Size of: ", stringify!(_ARM64EC_NT_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_ARM64EC_NT_CONTEXT>(),
    16usize,
    concat!("Alignment of ", stringify!(_ARM64EC_NT_CONTEXT))
  );
}
pub type ARM64EC_NT_CONTEXT = _ARM64EC_NT_CONTEXT;
pub type PARM64EC_NT_CONTEXT = *mut _ARM64EC_NT_CONTEXT;
pub type ARM64_RUNTIME_FUNCTION = _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY;
pub type PARM64_RUNTIME_FUNCTION = *mut _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_CONTEXT_NONVOLREG_ARM64 {
  pub Buffer: [BYTE; 152usize],
  pub __bindgen_anon_1: _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1 {
  pub GpNvRegs: [DWORD64; 11usize],
  pub FpNvRegs: [f64; 8usize],
}
#[test]
fn bindgen_test_layout__DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1>(),
    152usize,
    concat!(
      "Size of: ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).GpNvRegs) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1),
      "::",
      stringify!(GpNvRegs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FpNvRegs) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1),
      "::",
      stringify!(FpNvRegs)
    )
  );
}
#[test]
fn bindgen_test_layout__DISPATCHER_CONTEXT_NONVOLREG_ARM64() {
  const UNINIT: ::std::mem::MaybeUninit<_DISPATCHER_CONTEXT_NONVOLREG_ARM64> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64>(),
    152usize,
    concat!("Size of: ", stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64))
  );
  assert_eq!(
    ::std::mem::align_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64),
      "::",
      stringify!(Buffer)
    )
  );
}
pub type DISPATCHER_CONTEXT_NONVOLREG_ARM64 = _DISPATCHER_CONTEXT_NONVOLREG_ARM64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT_ARM64 {
  pub ControlPc: ULONG_PTR,
  pub ImageBase: ULONG_PTR,
  pub FunctionEntry: PARM64_RUNTIME_FUNCTION,
  pub EstablisherFrame: ULONG_PTR,
  pub TargetPc: ULONG_PTR,
  pub ContextRecord: PARM64_NT_CONTEXT,
  pub LanguageHandler: PEXCEPTION_ROUTINE,
  pub HandlerData: PVOID,
  pub HistoryTable: *mut _UNWIND_HISTORY_TABLE,
  pub ScopeIndex: DWORD,
  pub ControlPcIsUnwound: BOOLEAN,
  pub NonVolatileRegisters: PBYTE,
}
#[test]
fn bindgen_test_layout__DISPATCHER_CONTEXT_ARM64() {
  const UNINIT: ::std::mem::MaybeUninit<_DISPATCHER_CONTEXT_ARM64> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_DISPATCHER_CONTEXT_ARM64>(),
    88usize,
    concat!("Size of: ", stringify!(_DISPATCHER_CONTEXT_ARM64))
  );
  assert_eq!(
    ::std::mem::align_of::<_DISPATCHER_CONTEXT_ARM64>(),
    8usize,
    concat!("Alignment of ", stringify!(_DISPATCHER_CONTEXT_ARM64))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ControlPc) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(ControlPc)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ImageBase) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(ImageBase)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FunctionEntry) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(FunctionEntry)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EstablisherFrame) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(EstablisherFrame)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).TargetPc) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(TargetPc)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextRecord) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(ContextRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LanguageHandler) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(LanguageHandler)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HandlerData) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(HandlerData)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HistoryTable) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(HistoryTable)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ScopeIndex) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(ScopeIndex)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ControlPcIsUnwound) as usize - ptr as usize },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(ControlPcIsUnwound)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).NonVolatileRegisters) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_DISPATCHER_CONTEXT_ARM64),
      "::",
      stringify!(NonVolatileRegisters)
    )
  );
}
pub type DISPATCHER_CONTEXT_ARM64 = _DISPATCHER_CONTEXT_ARM64;
pub type PDISPATCHER_CONTEXT_ARM64 = *mut _DISPATCHER_CONTEXT_ARM64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS_ARM64 {
  pub X19: PDWORD64,
  pub X20: PDWORD64,
  pub X21: PDWORD64,
  pub X22: PDWORD64,
  pub X23: PDWORD64,
  pub X24: PDWORD64,
  pub X25: PDWORD64,
  pub X26: PDWORD64,
  pub X27: PDWORD64,
  pub X28: PDWORD64,
  pub Fp: PDWORD64,
  pub Lr: PDWORD64,
  pub D8: PDWORD64,
  pub D9: PDWORD64,
  pub D10: PDWORD64,
  pub D11: PDWORD64,
  pub D12: PDWORD64,
  pub D13: PDWORD64,
  pub D14: PDWORD64,
  pub D15: PDWORD64,
}
#[test]
fn bindgen_test_layout__KNONVOLATILE_CONTEXT_POINTERS_ARM64() {
  const UNINIT: ::std::mem::MaybeUninit<_KNONVOLATILE_CONTEXT_POINTERS_ARM64> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS_ARM64>(),
    160usize,
    concat!(
      "Size of: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS_ARM64>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X19) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X19)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X20) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X20)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X21) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X21)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X22) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X22)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X23) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X23)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X24) as usize - ptr as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X24)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X25) as usize - ptr as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X25)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X26) as usize - ptr as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X26)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X27) as usize - ptr as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X27)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).X28) as usize - ptr as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(X28)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Fp) as usize - ptr as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(Fp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Lr) as usize - ptr as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(Lr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D8) as usize - ptr as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D8)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D9) as usize - ptr as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D9)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D10) as usize - ptr as usize },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D10)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D11) as usize - ptr as usize },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D11)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D12) as usize - ptr as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D12)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D13) as usize - ptr as usize },
    136usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D13)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D14) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D14)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).D15) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64),
      "::",
      stringify!(D15)
    )
  );
}
pub type KNONVOLATILE_CONTEXT_POINTERS_ARM64 = _KNONVOLATILE_CONTEXT_POINTERS_ARM64;
pub type PKNONVOLATILE_CONTEXT_POINTERS_ARM64 = *mut _KNONVOLATILE_CONTEXT_POINTERS_ARM64;
extern "C" {
  pub fn __int2c() -> !;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _LDT_ENTRY {
  pub LimitLow: WORD,
  pub BaseLow: WORD,
  pub HighWord: _LDT_ENTRY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LDT_ENTRY__bindgen_ty_1 {
  pub Bytes: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1,
  pub Bits: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1 {
  pub BaseMid: BYTE,
  pub Flags1: BYTE,
  pub Flags2: BYTE,
  pub BaseHi: BYTE,
}
#[test]
fn bindgen_test_layout__LDT_ENTRY__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseMid) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(BaseMid)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags1) as usize - ptr as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Flags1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags2) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Flags2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseHi) as usize - ptr as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(BaseHi)
    )
  );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
  pub _bitfield_align_1: [u8; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__LDT_ENTRY__bindgen_ty_1__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2)
    )
  );
}
impl _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
  #[inline]
  pub fn BaseMid(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_BaseMid(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn Type(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u32) }
  }
  #[inline]
  pub fn set_Type(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(8usize, 5u8, val as u64)
    }
  }
  #[inline]
  pub fn Dpl(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u32) }
  }
  #[inline]
  pub fn set_Dpl(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(13usize, 2u8, val as u64)
    }
  }
  #[inline]
  pub fn Pres(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Pres(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(15usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn LimitHi(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
  }
  #[inline]
  pub fn set_LimitHi(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub fn Sys(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Sys(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(20usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Reserved_0(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Reserved_0(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(21usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Default_Big(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Default_Big(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(22usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Granularity(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Granularity(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(23usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn BaseHi(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_BaseHi(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(24usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    BaseMid: DWORD,
    Type: DWORD,
    Dpl: DWORD,
    Pres: DWORD,
    LimitHi: DWORD,
    Sys: DWORD,
    Reserved_0: DWORD,
    Default_Big: DWORD,
    Granularity: DWORD,
    BaseHi: DWORD,
  ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 8u8, {
      let BaseMid: u32 = unsafe { ::std::mem::transmute(BaseMid) };
      BaseMid as u64
    });
    __bindgen_bitfield_unit.set(8usize, 5u8, {
      let Type: u32 = unsafe { ::std::mem::transmute(Type) };
      Type as u64
    });
    __bindgen_bitfield_unit.set(13usize, 2u8, {
      let Dpl: u32 = unsafe { ::std::mem::transmute(Dpl) };
      Dpl as u64
    });
    __bindgen_bitfield_unit.set(15usize, 1u8, {
      let Pres: u32 = unsafe { ::std::mem::transmute(Pres) };
      Pres as u64
    });
    __bindgen_bitfield_unit.set(16usize, 4u8, {
      let LimitHi: u32 = unsafe { ::std::mem::transmute(LimitHi) };
      LimitHi as u64
    });
    __bindgen_bitfield_unit.set(20usize, 1u8, {
      let Sys: u32 = unsafe { ::std::mem::transmute(Sys) };
      Sys as u64
    });
    __bindgen_bitfield_unit.set(21usize, 1u8, {
      let Reserved_0: u32 = unsafe { ::std::mem::transmute(Reserved_0) };
      Reserved_0 as u64
    });
    __bindgen_bitfield_unit.set(22usize, 1u8, {
      let Default_Big: u32 = unsafe { ::std::mem::transmute(Default_Big) };
      Default_Big as u64
    });
    __bindgen_bitfield_unit.set(23usize, 1u8, {
      let Granularity: u32 = unsafe { ::std::mem::transmute(Granularity) };
      Granularity as u64
    });
    __bindgen_bitfield_unit.set(24usize, 8u8, {
      let BaseHi: u32 = unsafe { ::std::mem::transmute(BaseHi) };
      BaseHi as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout__LDT_ENTRY__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_LDT_ENTRY__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(_LDT_ENTRY__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_LDT_ENTRY__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bytes) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1),
      "::",
      stringify!(Bytes)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bits) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY__bindgen_ty_1),
      "::",
      stringify!(Bits)
    )
  );
}
#[test]
fn bindgen_test_layout__LDT_ENTRY() {
  const UNINIT: ::std::mem::MaybeUninit<_LDT_ENTRY> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LDT_ENTRY>(),
    8usize,
    concat!("Size of: ", stringify!(_LDT_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_LDT_ENTRY>(),
    4usize,
    concat!("Alignment of ", stringify!(_LDT_ENTRY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LimitLow) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY),
      "::",
      stringify!(LimitLow)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseLow) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY),
      "::",
      stringify!(BaseLow)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighWord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LDT_ENTRY),
      "::",
      stringify!(HighWord)
    )
  );
}
pub type LDT_ENTRY = _LDT_ENTRY;
pub type PLDT_ENTRY = *mut _LDT_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_FLOATING_SAVE_AREA {
  pub ControlWord: DWORD,
  pub StatusWord: DWORD,
  pub TagWord: DWORD,
  pub ErrorOffset: DWORD,
  pub ErrorSelector: DWORD,
  pub DataOffset: DWORD,
  pub DataSelector: DWORD,
  pub RegisterArea: [BYTE; 80usize],
  pub Cr0NpxState: DWORD,
}
#[test]
fn bindgen_test_layout__WOW64_FLOATING_SAVE_AREA() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_FLOATING_SAVE_AREA> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_FLOATING_SAVE_AREA>(),
    112usize,
    concat!("Size of: ", stringify!(_WOW64_FLOATING_SAVE_AREA))
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_FLOATING_SAVE_AREA>(),
    4usize,
    concat!("Alignment of ", stringify!(_WOW64_FLOATING_SAVE_AREA))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ControlWord) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(ControlWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).StatusWord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(StatusWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).TagWord) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(TagWord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ErrorOffset) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(ErrorOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ErrorSelector) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(ErrorSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).DataOffset) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(DataOffset)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).DataSelector) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(DataSelector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).RegisterArea) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(RegisterArea)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Cr0NpxState) as usize - ptr as usize },
    108usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_FLOATING_SAVE_AREA),
      "::",
      stringify!(Cr0NpxState)
    )
  );
}
pub type WOW64_FLOATING_SAVE_AREA = _WOW64_FLOATING_SAVE_AREA;
pub type PWOW64_FLOATING_SAVE_AREA = *mut WOW64_FLOATING_SAVE_AREA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_CONTEXT {
  pub ContextFlags: DWORD,
  pub Dr0: DWORD,
  pub Dr1: DWORD,
  pub Dr2: DWORD,
  pub Dr3: DWORD,
  pub Dr6: DWORD,
  pub Dr7: DWORD,
  pub FloatSave: WOW64_FLOATING_SAVE_AREA,
  pub SegGs: DWORD,
  pub SegFs: DWORD,
  pub SegEs: DWORD,
  pub SegDs: DWORD,
  pub Edi: DWORD,
  pub Esi: DWORD,
  pub Ebx: DWORD,
  pub Edx: DWORD,
  pub Ecx: DWORD,
  pub Eax: DWORD,
  pub Ebp: DWORD,
  pub Eip: DWORD,
  pub SegCs: DWORD,
  pub EFlags: DWORD,
  pub Esp: DWORD,
  pub SegSs: DWORD,
  pub ExtendedRegisters: [BYTE; 512usize],
}
#[test]
fn bindgen_test_layout__WOW64_CONTEXT() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_CONTEXT> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_CONTEXT>(),
    716usize,
    concat!("Size of: ", stringify!(_WOW64_CONTEXT))
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_CONTEXT>(),
    4usize,
    concat!("Alignment of ", stringify!(_WOW64_CONTEXT))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextFlags) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(ContextFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr0) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr0)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr1) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr2) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr3) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr3)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr6) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr6)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Dr7) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Dr7)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).FloatSave) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(FloatSave)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegGs) as usize - ptr as usize },
    140usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegGs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegFs) as usize - ptr as usize },
    144usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegFs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegEs) as usize - ptr as usize },
    148usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegEs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegDs) as usize - ptr as usize },
    152usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegDs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Edi) as usize - ptr as usize },
    156usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Edi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Esi) as usize - ptr as usize },
    160usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Esi)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ebx) as usize - ptr as usize },
    164usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Ebx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Edx) as usize - ptr as usize },
    168usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Edx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ecx) as usize - ptr as usize },
    172usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Ecx)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Eax) as usize - ptr as usize },
    176usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Eax)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Ebp) as usize - ptr as usize },
    180usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Ebp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Eip) as usize - ptr as usize },
    184usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Eip)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegCs) as usize - ptr as usize },
    188usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegCs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).EFlags) as usize - ptr as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(EFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Esp) as usize - ptr as usize },
    196usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(Esp)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SegSs) as usize - ptr as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(SegSs)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExtendedRegisters) as usize - ptr as usize },
    204usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_CONTEXT),
      "::",
      stringify!(ExtendedRegisters)
    )
  );
}
pub type WOW64_CONTEXT = _WOW64_CONTEXT;
pub type PWOW64_CONTEXT = *mut WOW64_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _WOW64_LDT_ENTRY {
  pub LimitLow: WORD,
  pub BaseLow: WORD,
  pub HighWord: _WOW64_LDT_ENTRY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _WOW64_LDT_ENTRY__bindgen_ty_1 {
  pub Bytes: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1,
  pub Bits: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1 {
  pub BaseMid: BYTE,
  pub Flags1: BYTE,
  pub Flags2: BYTE,
  pub BaseHi: BYTE,
}
#[test]
fn bindgen_test_layout__WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseMid) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(BaseMid)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags1) as usize - ptr as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Flags1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags2) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Flags2)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseHi) as usize - ptr as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(BaseHi)
    )
  );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
  pub _bitfield_align_1: [u8; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2)
    )
  );
}
impl _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
  #[inline]
  pub fn BaseMid(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_BaseMid(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn Type(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u32) }
  }
  #[inline]
  pub fn set_Type(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(8usize, 5u8, val as u64)
    }
  }
  #[inline]
  pub fn Dpl(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u32) }
  }
  #[inline]
  pub fn set_Dpl(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(13usize, 2u8, val as u64)
    }
  }
  #[inline]
  pub fn Pres(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Pres(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(15usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn LimitHi(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
  }
  #[inline]
  pub fn set_LimitHi(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub fn Sys(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Sys(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(20usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Reserved_0(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Reserved_0(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(21usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Default_Big(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Default_Big(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(22usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Granularity(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Granularity(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(23usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn BaseHi(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
  }
  #[inline]
  pub fn set_BaseHi(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(24usize, 8u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    BaseMid: DWORD,
    Type: DWORD,
    Dpl: DWORD,
    Pres: DWORD,
    LimitHi: DWORD,
    Sys: DWORD,
    Reserved_0: DWORD,
    Default_Big: DWORD,
    Granularity: DWORD,
    BaseHi: DWORD,
  ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 8u8, {
      let BaseMid: u32 = unsafe { ::std::mem::transmute(BaseMid) };
      BaseMid as u64
    });
    __bindgen_bitfield_unit.set(8usize, 5u8, {
      let Type: u32 = unsafe { ::std::mem::transmute(Type) };
      Type as u64
    });
    __bindgen_bitfield_unit.set(13usize, 2u8, {
      let Dpl: u32 = unsafe { ::std::mem::transmute(Dpl) };
      Dpl as u64
    });
    __bindgen_bitfield_unit.set(15usize, 1u8, {
      let Pres: u32 = unsafe { ::std::mem::transmute(Pres) };
      Pres as u64
    });
    __bindgen_bitfield_unit.set(16usize, 4u8, {
      let LimitHi: u32 = unsafe { ::std::mem::transmute(LimitHi) };
      LimitHi as u64
    });
    __bindgen_bitfield_unit.set(20usize, 1u8, {
      let Sys: u32 = unsafe { ::std::mem::transmute(Sys) };
      Sys as u64
    });
    __bindgen_bitfield_unit.set(21usize, 1u8, {
      let Reserved_0: u32 = unsafe { ::std::mem::transmute(Reserved_0) };
      Reserved_0 as u64
    });
    __bindgen_bitfield_unit.set(22usize, 1u8, {
      let Default_Big: u32 = unsafe { ::std::mem::transmute(Default_Big) };
      Default_Big as u64
    });
    __bindgen_bitfield_unit.set(23usize, 1u8, {
      let Granularity: u32 = unsafe { ::std::mem::transmute(Granularity) };
      Granularity as u64
    });
    __bindgen_bitfield_unit.set(24usize, 8u8, {
      let BaseHi: u32 = unsafe { ::std::mem::transmute(BaseHi) };
      BaseHi as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout__WOW64_LDT_ENTRY__bindgen_ty_1() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_LDT_ENTRY__bindgen_ty_1> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bytes) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1),
      "::",
      stringify!(Bytes)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Bits) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY__bindgen_ty_1),
      "::",
      stringify!(Bits)
    )
  );
}
#[test]
fn bindgen_test_layout__WOW64_LDT_ENTRY() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_LDT_ENTRY> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_LDT_ENTRY>(),
    8usize,
    concat!("Size of: ", stringify!(_WOW64_LDT_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_LDT_ENTRY>(),
    4usize,
    concat!("Alignment of ", stringify!(_WOW64_LDT_ENTRY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).LimitLow) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY),
      "::",
      stringify!(LimitLow)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).BaseLow) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY),
      "::",
      stringify!(BaseLow)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).HighWord) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_LDT_ENTRY),
      "::",
      stringify!(HighWord)
    )
  );
}
pub type WOW64_LDT_ENTRY = _WOW64_LDT_ENTRY;
pub type PWOW64_LDT_ENTRY = *mut _WOW64_LDT_ENTRY;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _WOW64_DESCRIPTOR_TABLE_ENTRY {
  pub Selector: DWORD,
  pub Descriptor: WOW64_LDT_ENTRY,
}
#[test]
fn bindgen_test_layout__WOW64_DESCRIPTOR_TABLE_ENTRY() {
  const UNINIT: ::std::mem::MaybeUninit<_WOW64_DESCRIPTOR_TABLE_ENTRY> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_WOW64_DESCRIPTOR_TABLE_ENTRY>(),
    12usize,
    concat!("Size of: ", stringify!(_WOW64_DESCRIPTOR_TABLE_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_WOW64_DESCRIPTOR_TABLE_ENTRY>(),
    4usize,
    concat!("Alignment of ", stringify!(_WOW64_DESCRIPTOR_TABLE_ENTRY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Selector) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_DESCRIPTOR_TABLE_ENTRY),
      "::",
      stringify!(Selector)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Descriptor) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_WOW64_DESCRIPTOR_TABLE_ENTRY),
      "::",
      stringify!(Descriptor)
    )
  );
}
pub type WOW64_DESCRIPTOR_TABLE_ENTRY = _WOW64_DESCRIPTOR_TABLE_ENTRY;
pub type PWOW64_DESCRIPTOR_TABLE_ENTRY = *mut _WOW64_DESCRIPTOR_TABLE_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD {
  pub ExceptionCode: DWORD,
  pub ExceptionFlags: DWORD,
  pub ExceptionRecord: *mut _EXCEPTION_RECORD,
  pub ExceptionAddress: PVOID,
  pub NumberParameters: DWORD,
  pub ExceptionInformation: [ULONG_PTR; 15usize],
}
#[test]
fn bindgen_test_layout__EXCEPTION_RECORD() {
  const UNINIT: ::std::mem::MaybeUninit<_EXCEPTION_RECORD> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_EXCEPTION_RECORD>(),
    152usize,
    concat!("Size of: ", stringify!(_EXCEPTION_RECORD))
  );
  assert_eq!(
    ::std::mem::align_of::<_EXCEPTION_RECORD>(),
    8usize,
    concat!("Alignment of ", stringify!(_EXCEPTION_RECORD))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionCode) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(ExceptionCode)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionFlags) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(ExceptionFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionRecord) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(ExceptionRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionAddress) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(ExceptionAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).NumberParameters) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(NumberParameters)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionInformation) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD),
      "::",
      stringify!(ExceptionInformation)
    )
  );
}
pub type EXCEPTION_RECORD = _EXCEPTION_RECORD;
pub type PEXCEPTION_RECORD = *mut EXCEPTION_RECORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD32 {
  pub ExceptionCode: DWORD,
  pub ExceptionFlags: DWORD,
  pub ExceptionRecord: DWORD,
  pub ExceptionAddress: DWORD,
  pub NumberParameters: DWORD,
  pub ExceptionInformation: [DWORD; 15usize],
}
#[test]
fn bindgen_test_layout__EXCEPTION_RECORD32() {
  const UNINIT: ::std::mem::MaybeUninit<_EXCEPTION_RECORD32> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_EXCEPTION_RECORD32>(),
    80usize,
    concat!("Size of: ", stringify!(_EXCEPTION_RECORD32))
  );
  assert_eq!(
    ::std::mem::align_of::<_EXCEPTION_RECORD32>(),
    4usize,
    concat!("Alignment of ", stringify!(_EXCEPTION_RECORD32))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionCode) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(ExceptionCode)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionFlags) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(ExceptionFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionRecord) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(ExceptionRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionAddress) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(ExceptionAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).NumberParameters) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(NumberParameters)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionInformation) as usize - ptr as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD32),
      "::",
      stringify!(ExceptionInformation)
    )
  );
}
pub type EXCEPTION_RECORD32 = _EXCEPTION_RECORD32;
pub type PEXCEPTION_RECORD32 = *mut _EXCEPTION_RECORD32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD64 {
  pub ExceptionCode: DWORD,
  pub ExceptionFlags: DWORD,
  pub ExceptionRecord: DWORD64,
  pub ExceptionAddress: DWORD64,
  pub NumberParameters: DWORD,
  pub __unusedAlignment: DWORD,
  pub ExceptionInformation: [DWORD64; 15usize],
}
#[test]
fn bindgen_test_layout__EXCEPTION_RECORD64() {
  const UNINIT: ::std::mem::MaybeUninit<_EXCEPTION_RECORD64> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_EXCEPTION_RECORD64>(),
    152usize,
    concat!("Size of: ", stringify!(_EXCEPTION_RECORD64))
  );
  assert_eq!(
    ::std::mem::align_of::<_EXCEPTION_RECORD64>(),
    8usize,
    concat!("Alignment of ", stringify!(_EXCEPTION_RECORD64))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionCode) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(ExceptionCode)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionFlags) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(ExceptionFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionRecord) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(ExceptionRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionAddress) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(ExceptionAddress)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).NumberParameters) as usize - ptr as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(NumberParameters)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).__unusedAlignment) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(__unusedAlignment)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionInformation) as usize - ptr as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_RECORD64),
      "::",
      stringify!(ExceptionInformation)
    )
  );
}
pub type EXCEPTION_RECORD64 = _EXCEPTION_RECORD64;
pub type PEXCEPTION_RECORD64 = *mut _EXCEPTION_RECORD64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_POINTERS {
  pub ExceptionRecord: PEXCEPTION_RECORD,
  pub ContextRecord: PCONTEXT,
}
#[test]
fn bindgen_test_layout__EXCEPTION_POINTERS() {
  const UNINIT: ::std::mem::MaybeUninit<_EXCEPTION_POINTERS> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_EXCEPTION_POINTERS>(),
    16usize,
    concat!("Size of: ", stringify!(_EXCEPTION_POINTERS))
  );
  assert_eq!(
    ::std::mem::align_of::<_EXCEPTION_POINTERS>(),
    8usize,
    concat!("Alignment of ", stringify!(_EXCEPTION_POINTERS))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ExceptionRecord) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_POINTERS),
      "::",
      stringify!(ExceptionRecord)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ContextRecord) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_EXCEPTION_POINTERS),
      "::",
      stringify!(ContextRecord)
    )
  );
}
pub type EXCEPTION_POINTERS = _EXCEPTION_POINTERS;
pub type PEXCEPTION_POINTERS = *mut _EXCEPTION_POINTERS;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type PCLAIMS_BLOB = PVOID;
pub type ACCESS_MASK = DWORD;
pub type PACCESS_MASK = *mut ACCESS_MASK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GENERIC_MAPPING {
  pub GenericRead: ACCESS_MASK,
  pub GenericWrite: ACCESS_MASK,
  pub GenericExecute: ACCESS_MASK,
  pub GenericAll: ACCESS_MASK,
}
#[test]
fn bindgen_test_layout__GENERIC_MAPPING() {
  const UNINIT: ::std::mem::MaybeUninit<_GENERIC_MAPPING> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_GENERIC_MAPPING>(),
    16usize,
    concat!("Size of: ", stringify!(_GENERIC_MAPPING))
  );
  assert_eq!(
    ::std::mem::align_of::<_GENERIC_MAPPING>(),
    4usize,
    concat!("Alignment of ", stringify!(_GENERIC_MAPPING))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).GenericRead) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericRead)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).GenericWrite) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericWrite)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).GenericExecute) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericExecute)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).GenericAll) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericAll)
    )
  );
}
pub type GENERIC_MAPPING = _GENERIC_MAPPING;
pub type PGENERIC_MAPPING = *mut GENERIC_MAPPING;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID_AND_ATTRIBUTES {
  pub Luid: LUID,
  pub Attributes: DWORD,
}
#[test]
fn bindgen_test_layout__LUID_AND_ATTRIBUTES() {
  const UNINIT: ::std::mem::MaybeUninit<_LUID_AND_ATTRIBUTES> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_LUID_AND_ATTRIBUTES>(),
    12usize,
    concat!("Size of: ", stringify!(_LUID_AND_ATTRIBUTES))
  );
  assert_eq!(
    ::std::mem::align_of::<_LUID_AND_ATTRIBUTES>(),
    4usize,
    concat!("Alignment of ", stringify!(_LUID_AND_ATTRIBUTES))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Luid) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID_AND_ATTRIBUTES),
      "::",
      stringify!(Luid)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Attributes) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID_AND_ATTRIBUTES),
      "::",
      stringify!(Attributes)
    )
  );
}
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
pub type PLUID_AND_ATTRIBUTES = *mut _LUID_AND_ATTRIBUTES;
pub type LUID_AND_ATTRIBUTES_ARRAY = [LUID_AND_ATTRIBUTES; 1usize];
pub type PLUID_AND_ATTRIBUTES_ARRAY = *mut LUID_AND_ATTRIBUTES_ARRAY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_IDENTIFIER_AUTHORITY {
  pub Value: [BYTE; 6usize],
}
#[test]
fn bindgen_test_layout__SID_IDENTIFIER_AUTHORITY() {
  const UNINIT: ::std::mem::MaybeUninit<_SID_IDENTIFIER_AUTHORITY> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SID_IDENTIFIER_AUTHORITY>(),
    6usize,
    concat!("Size of: ", stringify!(_SID_IDENTIFIER_AUTHORITY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_IDENTIFIER_AUTHORITY>(),
    1usize,
    concat!("Alignment of ", stringify!(_SID_IDENTIFIER_AUTHORITY))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_IDENTIFIER_AUTHORITY),
      "::",
      stringify!(Value)
    )
  );
}
pub type SID_IDENTIFIER_AUTHORITY = _SID_IDENTIFIER_AUTHORITY;
pub type PSID_IDENTIFIER_AUTHORITY = *mut _SID_IDENTIFIER_AUTHORITY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID {
  pub Revision: BYTE,
  pub SubAuthorityCount: BYTE,
  pub IdentifierAuthority: SID_IDENTIFIER_AUTHORITY,
  pub SubAuthority: [DWORD; 1usize],
}
#[test]
fn bindgen_test_layout__SID() {
  const UNINIT: ::std::mem::MaybeUninit<_SID> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SID>(),
    12usize,
    concat!("Size of: ", stringify!(_SID))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID>(),
    4usize,
    concat!("Alignment of ", stringify!(_SID))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Revision) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(Revision)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SubAuthorityCount) as usize - ptr as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(SubAuthorityCount)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).IdentifierAuthority) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(IdentifierAuthority)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SubAuthority) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(SubAuthority)
    )
  );
}
pub type SID = _SID;
pub type PISID = *mut _SID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_SID {
  pub Sid: SID,
  pub Buffer: [BYTE; 68usize],
}
#[test]
fn bindgen_test_layout__SE_SID() {
  const UNINIT: ::std::mem::MaybeUninit<_SE_SID> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SE_SID>(),
    68usize,
    concat!("Size of: ", stringify!(_SE_SID))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_SID>(),
    4usize,
    concat!("Alignment of ", stringify!(_SE_SID))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sid) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SID),
      "::",
      stringify!(Sid)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Buffer) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SID),
      "::",
      stringify!(Buffer)
    )
  );
}
pub type SE_SID = _SE_SID;
pub type PSE_SID = *mut _SE_SID;
pub const _SID_NAME_USE_SidTypeUser: _SID_NAME_USE = 1;
pub const _SID_NAME_USE_SidTypeGroup: _SID_NAME_USE = 2;
pub const _SID_NAME_USE_SidTypeDomain: _SID_NAME_USE = 3;
pub const _SID_NAME_USE_SidTypeAlias: _SID_NAME_USE = 4;
pub const _SID_NAME_USE_SidTypeWellKnownGroup: _SID_NAME_USE = 5;
pub const _SID_NAME_USE_SidTypeDeletedAccount: _SID_NAME_USE = 6;
pub const _SID_NAME_USE_SidTypeInvalid: _SID_NAME_USE = 7;
pub const _SID_NAME_USE_SidTypeUnknown: _SID_NAME_USE = 8;
pub const _SID_NAME_USE_SidTypeComputer: _SID_NAME_USE = 9;
pub const _SID_NAME_USE_SidTypeLabel: _SID_NAME_USE = 10;
pub const _SID_NAME_USE_SidTypeLogonSession: _SID_NAME_USE = 11;
pub type _SID_NAME_USE = ::std::os::raw::c_int;
pub use self::_SID_NAME_USE as SID_NAME_USE;
pub type PSID_NAME_USE = *mut _SID_NAME_USE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES {
  pub Sid: PSID,
  pub Attributes: DWORD,
}
#[test]
fn bindgen_test_layout__SID_AND_ATTRIBUTES() {
  const UNINIT: ::std::mem::MaybeUninit<_SID_AND_ATTRIBUTES> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SID_AND_ATTRIBUTES>(),
    16usize,
    concat!("Size of: ", stringify!(_SID_AND_ATTRIBUTES))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_AND_ATTRIBUTES>(),
    8usize,
    concat!("Alignment of ", stringify!(_SID_AND_ATTRIBUTES))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sid) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES),
      "::",
      stringify!(Sid)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Attributes) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES),
      "::",
      stringify!(Attributes)
    )
  );
}
pub type SID_AND_ATTRIBUTES = _SID_AND_ATTRIBUTES;
pub type PSID_AND_ATTRIBUTES = *mut _SID_AND_ATTRIBUTES;
pub type SID_AND_ATTRIBUTES_ARRAY = [SID_AND_ATTRIBUTES; 1usize];
pub type PSID_AND_ATTRIBUTES_ARRAY = *mut SID_AND_ATTRIBUTES_ARRAY;
pub type SID_HASH_ENTRY = ULONG_PTR;
pub type PSID_HASH_ENTRY = *mut ULONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES_HASH {
  pub SidCount: DWORD,
  pub SidAttr: PSID_AND_ATTRIBUTES,
  pub Hash: [SID_HASH_ENTRY; 32usize],
}
#[test]
fn bindgen_test_layout__SID_AND_ATTRIBUTES_HASH() {
  const UNINIT: ::std::mem::MaybeUninit<_SID_AND_ATTRIBUTES_HASH> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SID_AND_ATTRIBUTES_HASH>(),
    272usize,
    concat!("Size of: ", stringify!(_SID_AND_ATTRIBUTES_HASH))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_AND_ATTRIBUTES_HASH>(),
    8usize,
    concat!("Alignment of ", stringify!(_SID_AND_ATTRIBUTES_HASH))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidCount) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(SidCount)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidAttr) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(SidAttr)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Hash) as usize - ptr as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(Hash)
    )
  );
}
pub type SID_AND_ATTRIBUTES_HASH = _SID_AND_ATTRIBUTES_HASH;
pub type PSID_AND_ATTRIBUTES_HASH = *mut _SID_AND_ATTRIBUTES_HASH;
pub const WELL_KNOWN_SID_TYPE_WinNullSid: WELL_KNOWN_SID_TYPE = 0;
pub const WELL_KNOWN_SID_TYPE_WinWorldSid: WELL_KNOWN_SID_TYPE = 1;
pub const WELL_KNOWN_SID_TYPE_WinLocalSid: WELL_KNOWN_SID_TYPE = 2;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerSid: WELL_KNOWN_SID_TYPE = 3;
pub const WELL_KNOWN_SID_TYPE_WinCreatorGroupSid: WELL_KNOWN_SID_TYPE = 4;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerServerSid: WELL_KNOWN_SID_TYPE = 5;
pub const WELL_KNOWN_SID_TYPE_WinCreatorGroupServerSid: WELL_KNOWN_SID_TYPE = 6;
pub const WELL_KNOWN_SID_TYPE_WinNtAuthoritySid: WELL_KNOWN_SID_TYPE = 7;
pub const WELL_KNOWN_SID_TYPE_WinDialupSid: WELL_KNOWN_SID_TYPE = 8;
pub const WELL_KNOWN_SID_TYPE_WinNetworkSid: WELL_KNOWN_SID_TYPE = 9;
pub const WELL_KNOWN_SID_TYPE_WinBatchSid: WELL_KNOWN_SID_TYPE = 10;
pub const WELL_KNOWN_SID_TYPE_WinInteractiveSid: WELL_KNOWN_SID_TYPE = 11;
pub const WELL_KNOWN_SID_TYPE_WinServiceSid: WELL_KNOWN_SID_TYPE = 12;
pub const WELL_KNOWN_SID_TYPE_WinAnonymousSid: WELL_KNOWN_SID_TYPE = 13;
pub const WELL_KNOWN_SID_TYPE_WinProxySid: WELL_KNOWN_SID_TYPE = 14;
pub const WELL_KNOWN_SID_TYPE_WinEnterpriseControllersSid: WELL_KNOWN_SID_TYPE = 15;
pub const WELL_KNOWN_SID_TYPE_WinSelfSid: WELL_KNOWN_SID_TYPE = 16;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticatedUserSid: WELL_KNOWN_SID_TYPE = 17;
pub const WELL_KNOWN_SID_TYPE_WinRestrictedCodeSid: WELL_KNOWN_SID_TYPE = 18;
pub const WELL_KNOWN_SID_TYPE_WinTerminalServerSid: WELL_KNOWN_SID_TYPE = 19;
pub const WELL_KNOWN_SID_TYPE_WinRemoteLogonIdSid: WELL_KNOWN_SID_TYPE = 20;
pub const WELL_KNOWN_SID_TYPE_WinLogonIdsSid: WELL_KNOWN_SID_TYPE = 21;
pub const WELL_KNOWN_SID_TYPE_WinLocalSystemSid: WELL_KNOWN_SID_TYPE = 22;
pub const WELL_KNOWN_SID_TYPE_WinLocalServiceSid: WELL_KNOWN_SID_TYPE = 23;
pub const WELL_KNOWN_SID_TYPE_WinNetworkServiceSid: WELL_KNOWN_SID_TYPE = 24;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDomainSid: WELL_KNOWN_SID_TYPE = 25;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAdministratorsSid: WELL_KNOWN_SID_TYPE = 26;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinUsersSid: WELL_KNOWN_SID_TYPE = 27;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinGuestsSid: WELL_KNOWN_SID_TYPE = 28;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPowerUsersSid: WELL_KNOWN_SID_TYPE = 29;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAccountOperatorsSid: WELL_KNOWN_SID_TYPE = 30;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinSystemOperatorsSid: WELL_KNOWN_SID_TYPE = 31;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPrintOperatorsSid: WELL_KNOWN_SID_TYPE = 32;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinBackupOperatorsSid: WELL_KNOWN_SID_TYPE = 33;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinReplicatorSid: WELL_KNOWN_SID_TYPE = 34;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPreWindows2000CompatibleAccessSid: WELL_KNOWN_SID_TYPE = 35;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRemoteDesktopUsersSid: WELL_KNOWN_SID_TYPE = 36;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinNetworkConfigurationOperatorsSid: WELL_KNOWN_SID_TYPE = 37;
pub const WELL_KNOWN_SID_TYPE_WinAccountAdministratorSid: WELL_KNOWN_SID_TYPE = 38;
pub const WELL_KNOWN_SID_TYPE_WinAccountGuestSid: WELL_KNOWN_SID_TYPE = 39;
pub const WELL_KNOWN_SID_TYPE_WinAccountKrbtgtSid: WELL_KNOWN_SID_TYPE = 40;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainAdminsSid: WELL_KNOWN_SID_TYPE = 41;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainUsersSid: WELL_KNOWN_SID_TYPE = 42;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainGuestsSid: WELL_KNOWN_SID_TYPE = 43;
pub const WELL_KNOWN_SID_TYPE_WinAccountComputersSid: WELL_KNOWN_SID_TYPE = 44;
pub const WELL_KNOWN_SID_TYPE_WinAccountControllersSid: WELL_KNOWN_SID_TYPE = 45;
pub const WELL_KNOWN_SID_TYPE_WinAccountCertAdminsSid: WELL_KNOWN_SID_TYPE = 46;
pub const WELL_KNOWN_SID_TYPE_WinAccountSchemaAdminsSid: WELL_KNOWN_SID_TYPE = 47;
pub const WELL_KNOWN_SID_TYPE_WinAccountEnterpriseAdminsSid: WELL_KNOWN_SID_TYPE = 48;
pub const WELL_KNOWN_SID_TYPE_WinAccountPolicyAdminsSid: WELL_KNOWN_SID_TYPE = 49;
pub const WELL_KNOWN_SID_TYPE_WinAccountRasAndIasServersSid: WELL_KNOWN_SID_TYPE = 50;
pub const WELL_KNOWN_SID_TYPE_WinNTLMAuthenticationSid: WELL_KNOWN_SID_TYPE = 51;
pub const WELL_KNOWN_SID_TYPE_WinDigestAuthenticationSid: WELL_KNOWN_SID_TYPE = 52;
pub const WELL_KNOWN_SID_TYPE_WinSChannelAuthenticationSid: WELL_KNOWN_SID_TYPE = 53;
pub const WELL_KNOWN_SID_TYPE_WinThisOrganizationSid: WELL_KNOWN_SID_TYPE = 54;
pub const WELL_KNOWN_SID_TYPE_WinOtherOrganizationSid: WELL_KNOWN_SID_TYPE = 55;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinIncomingForestTrustBuildersSid: WELL_KNOWN_SID_TYPE = 56;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPerfMonitoringUsersSid: WELL_KNOWN_SID_TYPE = 57;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPerfLoggingUsersSid: WELL_KNOWN_SID_TYPE = 58;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAuthorizationAccessSid: WELL_KNOWN_SID_TYPE = 59;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinTerminalServerLicenseServersSid: WELL_KNOWN_SID_TYPE = 60;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDCOMUsersSid: WELL_KNOWN_SID_TYPE = 61;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinIUsersSid: WELL_KNOWN_SID_TYPE = 62;
pub const WELL_KNOWN_SID_TYPE_WinIUserSid: WELL_KNOWN_SID_TYPE = 63;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinCryptoOperatorsSid: WELL_KNOWN_SID_TYPE = 64;
pub const WELL_KNOWN_SID_TYPE_WinUntrustedLabelSid: WELL_KNOWN_SID_TYPE = 65;
pub const WELL_KNOWN_SID_TYPE_WinLowLabelSid: WELL_KNOWN_SID_TYPE = 66;
pub const WELL_KNOWN_SID_TYPE_WinMediumLabelSid: WELL_KNOWN_SID_TYPE = 67;
pub const WELL_KNOWN_SID_TYPE_WinHighLabelSid: WELL_KNOWN_SID_TYPE = 68;
pub const WELL_KNOWN_SID_TYPE_WinSystemLabelSid: WELL_KNOWN_SID_TYPE = 69;
pub const WELL_KNOWN_SID_TYPE_WinWriteRestrictedCodeSid: WELL_KNOWN_SID_TYPE = 70;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerRightsSid: WELL_KNOWN_SID_TYPE = 71;
pub const WELL_KNOWN_SID_TYPE_WinCacheablePrincipalsGroupSid: WELL_KNOWN_SID_TYPE = 72;
pub const WELL_KNOWN_SID_TYPE_WinNonCacheablePrincipalsGroupSid: WELL_KNOWN_SID_TYPE = 73;
pub const WELL_KNOWN_SID_TYPE_WinEnterpriseReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 74;
pub const WELL_KNOWN_SID_TYPE_WinAccountReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 75;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinEventLogReadersGroup: WELL_KNOWN_SID_TYPE = 76;
pub const WELL_KNOWN_SID_TYPE_WinNewEnterpriseReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 77;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinCertSvcDComAccessGroup: WELL_KNOWN_SID_TYPE = 78;
pub const WELL_KNOWN_SID_TYPE_WinMediumPlusLabelSid: WELL_KNOWN_SID_TYPE = 79;
pub const WELL_KNOWN_SID_TYPE_WinLocalLogonSid: WELL_KNOWN_SID_TYPE = 80;
pub const WELL_KNOWN_SID_TYPE_WinConsoleLogonSid: WELL_KNOWN_SID_TYPE = 81;
pub const WELL_KNOWN_SID_TYPE_WinThisOrganizationCertificateSid: WELL_KNOWN_SID_TYPE = 82;
pub const WELL_KNOWN_SID_TYPE_WinApplicationPackageAuthoritySid: WELL_KNOWN_SID_TYPE = 83;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAnyPackageSid: WELL_KNOWN_SID_TYPE = 84;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityInternetClientSid: WELL_KNOWN_SID_TYPE = 85;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityInternetClientServerSid: WELL_KNOWN_SID_TYPE = 86;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityPrivateNetworkClientServerSid: WELL_KNOWN_SID_TYPE = 87;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityPicturesLibrarySid: WELL_KNOWN_SID_TYPE = 88;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityVideosLibrarySid: WELL_KNOWN_SID_TYPE = 89;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityMusicLibrarySid: WELL_KNOWN_SID_TYPE = 90;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityDocumentsLibrarySid: WELL_KNOWN_SID_TYPE = 91;
pub const WELL_KNOWN_SID_TYPE_WinCapabilitySharedUserCertificatesSid: WELL_KNOWN_SID_TYPE = 92;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityEnterpriseAuthenticationSid: WELL_KNOWN_SID_TYPE = 93;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityRemovableStorageSid: WELL_KNOWN_SID_TYPE = 94;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSRemoteAccessServersSid: WELL_KNOWN_SID_TYPE = 95;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSEndpointServersSid: WELL_KNOWN_SID_TYPE = 96;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSManagementServersSid: WELL_KNOWN_SID_TYPE = 97;
pub const WELL_KNOWN_SID_TYPE_WinUserModeDriversSid: WELL_KNOWN_SID_TYPE = 98;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinHyperVAdminsSid: WELL_KNOWN_SID_TYPE = 99;
pub const WELL_KNOWN_SID_TYPE_WinAccountCloneableControllersSid: WELL_KNOWN_SID_TYPE = 100;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAccessControlAssistanceOperatorsSid: WELL_KNOWN_SID_TYPE =
  101;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRemoteManagementUsersSid: WELL_KNOWN_SID_TYPE = 102;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationAuthorityAssertedSid: WELL_KNOWN_SID_TYPE = 103;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationServiceAssertedSid: WELL_KNOWN_SID_TYPE = 104;
pub const WELL_KNOWN_SID_TYPE_WinLocalAccountSid: WELL_KNOWN_SID_TYPE = 105;
pub const WELL_KNOWN_SID_TYPE_WinLocalAccountAndAdministratorSid: WELL_KNOWN_SID_TYPE = 106;
pub const WELL_KNOWN_SID_TYPE_WinAccountProtectedUsersSid: WELL_KNOWN_SID_TYPE = 107;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityAppointmentsSid: WELL_KNOWN_SID_TYPE = 108;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityContactsSid: WELL_KNOWN_SID_TYPE = 109;
pub const WELL_KNOWN_SID_TYPE_WinAccountDefaultSystemManagedSid: WELL_KNOWN_SID_TYPE = 110;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDefaultSystemManagedGroupSid: WELL_KNOWN_SID_TYPE = 111;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinStorageReplicaAdminsSid: WELL_KNOWN_SID_TYPE = 112;
pub const WELL_KNOWN_SID_TYPE_WinAccountKeyAdminsSid: WELL_KNOWN_SID_TYPE = 113;
pub const WELL_KNOWN_SID_TYPE_WinAccountEnterpriseKeyAdminsSid: WELL_KNOWN_SID_TYPE = 114;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyTrustSid: WELL_KNOWN_SID_TYPE = 115;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyPropertyMFASid: WELL_KNOWN_SID_TYPE = 116;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyPropertyAttestationSid: WELL_KNOWN_SID_TYPE = 117;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationFreshKeyAuthSid: WELL_KNOWN_SID_TYPE = 118;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDeviceOwnersSid: WELL_KNOWN_SID_TYPE = 119;
pub type WELL_KNOWN_SID_TYPE = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL {
  pub AclRevision: BYTE,
  pub Sbz1: BYTE,
  pub AclSize: WORD,
  pub AceCount: WORD,
  pub Sbz2: WORD,
}
#[test]
fn bindgen_test_layout__ACL() {
  const UNINIT: ::std::mem::MaybeUninit<_ACL> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACL>(),
    8usize,
    concat!("Size of: ", stringify!(_ACL))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACL>(),
    2usize,
    concat!("Alignment of ", stringify!(_ACL))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AclRevision) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AclRevision)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sbz1) as usize - ptr as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(Sbz1)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AclSize) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AclSize)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AceCount) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AceCount)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Sbz2) as usize - ptr as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(Sbz2)
    )
  );
}
pub type ACL = _ACL;
pub type PACL = *mut ACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACE_HEADER {
  pub AceType: BYTE,
  pub AceFlags: BYTE,
  pub AceSize: WORD,
}
#[test]
fn bindgen_test_layout__ACE_HEADER() {
  const UNINIT: ::std::mem::MaybeUninit<_ACE_HEADER> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACE_HEADER>(),
    4usize,
    concat!("Size of: ", stringify!(_ACE_HEADER))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACE_HEADER>(),
    2usize,
    concat!("Alignment of ", stringify!(_ACE_HEADER))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AceType) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AceFlags) as usize - ptr as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceFlags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AceSize) as usize - ptr as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceSize)
    )
  );
}
pub type ACE_HEADER = _ACE_HEADER;
pub type PACE_HEADER = *mut ACE_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_ALLOWED_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_ALLOWED_ACE> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_ALLOWED_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_ACCESS_ALLOWED_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_ALLOWED_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_ALLOWED_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_ALLOWED_ACE = _ACCESS_ALLOWED_ACE;
pub type PACCESS_ALLOWED_ACE = *mut ACCESS_ALLOWED_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_DENIED_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_DENIED_ACE> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_DENIED_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_ACCESS_DENIED_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_DENIED_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_DENIED_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_DENIED_ACE = _ACCESS_DENIED_ACE;
pub type PACCESS_DENIED_ACE = *mut ACCESS_DENIED_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_AUDIT_ACE> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_ACE = _SYSTEM_AUDIT_ACE;
pub type PSYSTEM_AUDIT_ACE = *mut SYSTEM_AUDIT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_ALARM_ACE> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_ACE = _SYSTEM_ALARM_ACE;
pub type PSYSTEM_ALARM_ACE = *mut SYSTEM_ALARM_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_RESOURCE_ATTRIBUTE_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_RESOURCE_ATTRIBUTE_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_RESOURCE_ATTRIBUTE_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_RESOURCE_ATTRIBUTE_ACE = _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
pub type PSYSTEM_RESOURCE_ATTRIBUTE_ACE = *mut _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_SCOPED_POLICY_ID_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_SCOPED_POLICY_ID_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_SCOPED_POLICY_ID_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_SCOPED_POLICY_ID_ACE = _SYSTEM_SCOPED_POLICY_ID_ACE;
pub type PSYSTEM_SCOPED_POLICY_ID_ACE = *mut _SYSTEM_SCOPED_POLICY_ID_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_MANDATORY_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_MANDATORY_LABEL_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_MANDATORY_LABEL_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_MANDATORY_LABEL_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_MANDATORY_LABEL_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_MANDATORY_LABEL_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_MANDATORY_LABEL_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_MANDATORY_LABEL_ACE = _SYSTEM_MANDATORY_LABEL_ACE;
pub type PSYSTEM_MANDATORY_LABEL_ACE = *mut _SYSTEM_MANDATORY_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESS_TRUST_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_PROCESS_TRUST_LABEL_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_PROCESS_TRUST_LABEL_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_PROCESS_TRUST_LABEL_ACE = _SYSTEM_PROCESS_TRUST_LABEL_ACE;
pub type PSYSTEM_PROCESS_TRUST_LABEL_ACE = *mut _SYSTEM_PROCESS_TRUST_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ACCESS_FILTER_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ACCESS_FILTER_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_ACCESS_FILTER_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ACCESS_FILTER_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ACCESS_FILTER_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ACCESS_FILTER_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ACCESS_FILTER_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ACCESS_FILTER_ACE = _SYSTEM_ACCESS_FILTER_ACE;
pub type PSYSTEM_ACCESS_FILTER_ACE = *mut _SYSTEM_ACCESS_FILTER_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_ALLOWED_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_ALLOWED_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_ALLOWED_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_ACCESS_ALLOWED_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_ALLOWED_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_ALLOWED_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_ALLOWED_OBJECT_ACE = _ACCESS_ALLOWED_OBJECT_ACE;
pub type PACCESS_ALLOWED_OBJECT_ACE = *mut _ACCESS_ALLOWED_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_DENIED_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_DENIED_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_DENIED_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_ACCESS_DENIED_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_DENIED_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_DENIED_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_DENIED_OBJECT_ACE = _ACCESS_DENIED_OBJECT_ACE;
pub type PACCESS_DENIED_OBJECT_ACE = *mut _ACCESS_DENIED_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_AUDIT_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_OBJECT_ACE = _SYSTEM_AUDIT_OBJECT_ACE;
pub type PSYSTEM_AUDIT_OBJECT_ACE = *mut _SYSTEM_AUDIT_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_ALARM_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_OBJECT_ACE = _SYSTEM_ALARM_OBJECT_ACE;
pub type PSYSTEM_ALARM_OBJECT_ACE = *mut _SYSTEM_ALARM_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_ALLOWED_CALLBACK_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_ALLOWED_CALLBACK_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_ALLOWED_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_ACCESS_ALLOWED_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_ALLOWED_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_ALLOWED_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_ALLOWED_CALLBACK_ACE = _ACCESS_ALLOWED_CALLBACK_ACE;
pub type PACCESS_ALLOWED_CALLBACK_ACE = *mut _ACCESS_ALLOWED_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_DENIED_CALLBACK_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_DENIED_CALLBACK_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_DENIED_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_ACCESS_DENIED_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_DENIED_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_DENIED_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_DENIED_CALLBACK_ACE = _ACCESS_DENIED_CALLBACK_ACE;
pub type PACCESS_DENIED_CALLBACK_ACE = *mut _ACCESS_DENIED_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_CALLBACK_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_AUDIT_CALLBACK_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_CALLBACK_ACE = _SYSTEM_AUDIT_CALLBACK_ACE;
pub type PSYSTEM_AUDIT_CALLBACK_ACE = *mut _SYSTEM_AUDIT_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_CALLBACK_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_ALARM_CALLBACK_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_CALLBACK_ACE = _SYSTEM_ALARM_CALLBACK_ACE;
pub type PSYSTEM_ALARM_CALLBACK_ACE = *mut _SYSTEM_ALARM_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_ALLOWED_CALLBACK_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_ALLOWED_CALLBACK_OBJECT_ACE = _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE;
pub type PACCESS_ALLOWED_CALLBACK_OBJECT_ACE = *mut _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__ACCESS_DENIED_CALLBACK_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_ACCESS_DENIED_CALLBACK_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_DENIED_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_DENIED_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type ACCESS_DENIED_CALLBACK_OBJECT_ACE = _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
pub type PACCESS_DENIED_CALLBACK_OBJECT_ACE = *mut _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_CALLBACK_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_CALLBACK_OBJECT_ACE = _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
pub type PSYSTEM_AUDIT_CALLBACK_OBJECT_ACE = *mut _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_CALLBACK_OBJECT_ACE() {
  const UNINIT: ::std::mem::MaybeUninit<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Header) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Mask) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).Flags) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).ObjectType) as usize - ptr as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).InheritedObjectType) as usize - ptr as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).SidStart) as usize - ptr as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_CALLBACK_OBJECT_ACE = _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub type PSYSTEM_ALARM_CALLBACK_OBJECT_ACE = *mut _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub const _ACL_INFORMATION_CLASS_AclRevisionInformation: _ACL_INFORMATION_CLASS = 1;
pub const _ACL_INFORMATION_CLASS_AclSizeInformation: _ACL_INFORMATION_CLASS = 2;
pub type _ACL_INFORMATION_CLASS = ::std::os::raw::c_int;
pub use self::_ACL_INFORMATION_CLASS as ACL_INFORMATION_CLASS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL_REVISION_INFORMATION {
  pub AclRevision: DWORD,
}
#[test]
fn bindgen_test_layout__ACL_REVISION_INFORMATION() {
  const UNINIT: ::std::mem::MaybeUninit<_ACL_REVISION_INFORMATION> =
    ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACL_REVISION_INFORMATION>(),
    4usize,
    concat!("Size of: ", stringify!(_ACL_REVISION_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACL_REVISION_INFORMATION>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACL_REVISION_INFORMATION))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AclRevision) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL_REVISION_INFORMATION),
      "::",
      stringify!(AclRevision)
    )
  );
}
pub type ACL_REVISION_INFORMATION = _ACL_REVISION_INFORMATION;
pub type PACL_REVISION_INFORMATION = *mut ACL_REVISION_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL_SIZE_INFORMATION {
  pub AceCount: DWORD,
  pub AclBytesInUse: DWORD,
  pub AclBytesFree: DWORD,
}
#[test]
fn bindgen_test_layout__ACL_SIZE_INFORMATION() {
  const UNINIT: ::std::mem::MaybeUninit<_ACL_SIZE_INFORMATION> = ::std::mem::MaybeUninit::uninit();
  let ptr = UNINIT.as_ptr();
  assert_eq!(
    ::std::mem::size_of::<_ACL_SIZE_INFORMATION>(),
    12usize,
    concat!("Size of: ", stringify!(_ACL_SIZE_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACL_SIZE_INFORMATION>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACL_SIZE_INFORMATION))
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AceCount) as usize - ptr as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL_SIZE_INFORMATION),
      "::",
      stringify!(AceCount)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AclBytesInUse) as usize - ptr as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL_SIZE_INFORMATION),
      "::",
      stringify!(AclBytesInUse)
    )
  );
  assert_eq!(
    unsafe { ::std::ptr::addr_of!((*ptr).AclBytesFree) as usize - ptr as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL_SIZE_INFORMATION),
      "::",
      stringify!(AclBytesFree)
    )
  );
}
pub type ACL_SIZE_INFORMATION = _ACL_SIZE_INFORMATION;
pub type PACL_SIZE_INFORMATION = *mut ACL_SIZE_INFORMATION;
pub type SECURITY_DESCRIPTOR_CONTROL = WORD;
